
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Transaction Fees · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="听风">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-ace/ace.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-terminal/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CH04_Acknowledgement.html" />
    
    
    <link rel="prev" href="CH02_Block_Rewards.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://f-labs.github.io/Cryptoeconomics" target="_blank" class="custom-link">Home</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    Decentralized Payment Systems Economics
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="CH00_Preface.html">
            
                <a href="CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="CH01_Valuation.html">
            
                <a href="CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="CH02_Block_Rewards.html">
            
                <a href="CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.5" data-path="CH03_Transaction_Fees.html">
            
                <a href="CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="CH04_Acknowledgement.html">
            
                <a href="CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Token_Economics_Incentive_design/">
            
                <a href="../Token_Economics_Incentive_design/">
            
                    
                    Token Economics Incentive design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../Token_Economics_Incentive_design/CH01.html">
            
                <a href="../Token_Economics_Incentive_design/CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../Token_Economics_Incentive_design/CH02.html">
            
                <a href="../Token_Economics_Incentive_design/CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../Token_Economics_Incentive_design/CH03.html">
            
                <a href="../Token_Economics_Incentive_design/CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../Token_Economics_Incentive_design/CH04.html">
            
                <a href="../Token_Economics_Incentive_design/CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../Token_Economics_Incentive_design/CH05.html">
            
                <a href="../Token_Economics_Incentive_design/CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../Token_Economics_Incentive_design/CH06.html">
            
                <a href="../Token_Economics_Incentive_design/CH06.html">
            
                    
                    用货币经济学进行token设计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Transaction Fees</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>
<ul class="sectlevel1">
<li><a href="#_7_3_transaction_fees">7.3  Transaction Fees&#xFF08;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF09;</a>
<ul class="sectlevel2">
<li><a href="#_7_3_1_fee_management_today">7.3.1  Fee management today&#xFF08;&#x5F53;&#x4ECA;&#x7684;&#x8D39;&#x7528;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#xFF09;</a></li>
<li><a href="#_7_3_2_design_considerations">7.3.2  Design considerations&#xFF08;&#x8D39;&#x7528;&#x8BBE;&#x8BA1;&#x8003;&#x8651;&#xFF09;</a>
<ul class="sectlevel3">
<li><a href="#_7_3_2_1_user_selected_fees_miner_gets_full_transaction_fees">7.3.2.1   User-selected fees, miner gets full transaction fees&#xFF08;&#x7528;&#x6237;&#x9009;&#x62E9;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x77FF;&#x5DE5;&#x83B7;&#x5F97;&#x5168;&#x989D;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF09;</a></li>
<li><a href="#_7_3_2_2_user_selected_fees_decoupled_rewards">7.3.2.2 User-selected fees, decoupled rewards&#xFF08;&#x7528;&#x6237;&#x9009;&#x62E9;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x5956;&#x52B1;&#x5206;&#x79BB;&#xFF09;</a></li>
<li><a href="#_7_3_2_3_algorithmic_fees_miner_gets_full_transaction_fees">7.3.2.3 Algorithmic fees, miner gets full transaction fees&#xFF08;&#x57FA;&#x4E8E;&#x7B97;&#x6CD5;&#x6536;&#x8D39;&#xFF0C;&#x77FF;&#x5DE5;&#x83B7;&#x5F97;&#x5168;&#x989D;&#x4EA4;&#x6613;&#x8D39;&#xFF09;</a></li>
<li><a href="#_7_3_2_4_algorithmic_fees_decoupled_rewards">7.3.2.4 Algorithmic fees, decoupled rewards.&#xFF08;&#x57FA;&#x4E8E;&#x7B97;&#x6CD5;&#x6536;&#x8D39;&#xFF0C;&#x5956;&#x52B1;&#x5206;&#x79BB;&#xFF09;</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div class="sect1">
<h2 id="_7_3_transaction_fees">7.3  Transaction Fees&#xFF08;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF09;</h2>
<div class="sectionbody">
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Another class of incentives known as transaction fees are drawn from users&#x2019; transactions and awarded to nodes who process that node&#x2019;s transactions. This can include both the block proposer and/or validator. A primary question in cryptocurrencies is how to choose transaction fees. A common approach&#x2014;used in Bitcoin and Ethereum, for example&#x2014;is to allow users to propose their own fees for each transaction. In such a system, miners are incentivized to prioritize high-fee transactions when forming blocks; the higher the transaction fee, the lower the con&#xFB01;rmation delay. Most cryptocurrencies also set a minimum transaction fee to prevent users spamming the network with transactions. Two important questions characterize the selection of transaction fees. The &#xFB01;rst is how to choose the magnitude of transaction fees; namely, should fees be proposed by users, imposed by the system, or some combination thereof? Typical considerations include scaling fees with the transaction&#x2019;s bytesize, monetary value, or both. The second question is how to allocate fees once they are collected. Recent work has shown that naive (and very common) methods of allocating fees can lead to incentive-incompatibility as well as increased confirmation latency. We begin this section by presenting an industry-standard approach to fee management in Section 7.3.1, and discussing why such an approach is unacceptable for a low-latency payment system. Next, we discuss alternatives, and highlight their advantages and disadvantages 7.3.2.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x53E6;&#x4E00;&#x79CD;&#x6FC0;&#x52B1;&#x63AA;&#x65BD;&#x88AB;&#x79F0;&#x4E3A;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x8FD9;&#x6765;&#x81EA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x88AB;&#x5956;&#x52B1;&#x7ED9;&#x5904;&#x7406;&#x8BE5;&#x8282;&#x70B9;&#x4EA4;&#x6613;&#x4E8B;&#x52A1;&#x7684;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5305;&#x542B;&#x4E86;&#x51FA;&#x5757;&#x8005;&#x548C;&#x9A8C;&#x8BC1;&#x8005;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x4E8C;&#x8005;&#x4E4B;&#x4E00;&#x3002;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x4E00;&#x4E2A;&#x9996;&#x8981;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x4EE5;&#x592A;&#x574A;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x65B9;&#x6CD5;&#x662F;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x4E3A;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x63D0;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x8D39;&#x7528;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5F53;&#x4EA7;&#x751F;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x9F13;&#x52B1;&#x77FF;&#x5DE5;&#x4F18;&#x5148;&#x5904;&#x7406;&#x9AD8;&#x6536;&#x8D39;&#x4EA4;&#x6613;&#xFF1B;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x8D8A;&#x9AD8;&#xFF0C;&#x786E;&#x8BA4;&#x5EF6;&#x8FDF;&#x8D8A;&#x4F4E;&#x3002;&#x5927;&#x591A;&#x6570;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x8FD8;&#x8BBE;&#x7F6E;&#x4E86;&#x6700;&#x4F4E;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x7528;&#x6237;&#x5411;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x5783;&#x573E;&#x4EA4;&#x6613;&#x3002;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x9009;&#x62E9;&#x6709;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x91CF;&#x7EA7;&#xFF1B;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8D39;&#x7528;&#x662F;&#x7531;&#x7528;&#x6237;&#x63D0;&#x51FA;&#xFF0C;&#x7531;&#x7CFB;&#x7EDF;&#x5F3A;&#x5236;&#x6267;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x67D0;&#x79CD;&#x7EC4;&#x5408;&#xFF1F;&#x5178;&#x578B;&#x7684;&#x8003;&#x8651;&#x56E0;&#x7D20;&#x5305;&#x62EC;&#x6309;&#x7167;&#x4EA4;&#x6613;&#x5C3A;&#x5BF8;&#xFF0C;&#x5E01;&#x503C;&#x6216;&#x8005;&#x4E24;&#x8005;&#x6765;&#x7F29;&#x653E;&#x8D39;&#x7528;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x5728;&#x6536;&#x96C6;&#x8D39;&#x7528;&#x540E;&#x5206;&#x914D;&#x8D39;&#x7528;&#x3002; &#x6700;&#x8FD1;&#x7684;&#x5DE5;&#x4F5C;&#x8868;&#x660E;&#xFF0C;&#x5206;&#x914D;&#x8D39;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x592A;&#x8FC7;&#x4E8E;&#x5355;&#x7EAF;&#xFF08;&#x548C;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#xFF09;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6FC0;&#x52B1;&#x4E0D;&#x517C;&#x5BB9;&#x4EE5;&#x53CA;&#x589E;&#x52A0;&#x7684;&#x786E;&#x8BA4;&#x5EF6;&#x8FDF;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x5C0F;&#x8282;7.3.1&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x884C;&#x4E1A;&#x6807;&#x51C6;&#x7684;&#x8D39;&#x7528;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#x672C;&#x8282;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5BF9;&#x4E8E;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x5728;&#x5C0F;&#x8282;7.3.2&#x4E2D;&#x7A81;&#x51FA;&#x5176;&#x4F18;&#x7F3A;&#x70B9;&#x3002;</p>
</div>
<div class="sect2">
<h3 id="_7_3_1_fee_management_today">7.3.1  Fee management today&#xFF08;&#x5F53;&#x4ECA;&#x7684;&#x8D39;&#x7528;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#xFF09;</h3>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Most existing cryptocurrencies allow users to set their own fees; validators choose whether to process a given transaction based on whether the offered transaction fee is high enough. If a miner (or proposer) includes a transaction in a block, that node reaps the full transaction fee as a reward. If a given transaction is not included in a block by any miner after some period of time, that same transaction can be re-broadcast with a higher fee. Although Bitcoin and Ethereum place lower bounds on the size of transaction fees, in practice, users tend to choose substantially higher transaction fees. This natural approach to fee selection is widely adopted, but it has three important negative repercussions: high congestion, high fees, and incentive incompatibility. We begin by describing each of these repercussions more precisely.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5927;&#x591A;&#x6570;&#x73B0;&#x5B58;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x90FD;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x8BBE;&#x5B9A;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF1B;&#x9A8C;&#x8BC1;&#x8005;&#x6839;&#x636E;&#x7ED9;&#x51FA;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x662F;&#x5426;&#x8DB3;&#x591F;&#x9AD8;&#x6765;&#x9009;&#x62E9;&#x662F;&#x5426;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x77FF;&#x5DE5;&#xFF08;&#x6216;&#x8005;&#x51FA;&#x5757;&#x8005;&#xFF09;&#x5C06;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x6253;&#x5305;&#x5230;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x90A3;&#x4E2A;&#x8282;&#x70B9;&#x6536;&#x83B7;&#x5168;&#x90E8;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4F5C;&#x4E3A;&#x5956;&#x52B1;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4EE5;&#x540E;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x6253;&#x5305;&#x5230;&#x533A;&#x5757;&#x4E2D;&#x53BB;&#xFF0C;&#x90A3;&#x4E48;&#x540C;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x53EF;&#x4EE5;&#x7528;&#x66F4;&#x9AD8;&#x7684;&#x8D39;&#x7528;&#x88AB;&#x91CD;&#x65B0;&#x5E7F;&#x64AD;&#x3002;&#x867D;&#x7136;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x4EE5;&#x592A;&#x574A;&#x5728;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x5927;&#x5C0F;&#x4E0A;&#x8BBE;&#x7F6E;&#x4E86;&#x4E0B;&#x9650;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x5B9E;&#x8D28;&#x4E0A;&#x503E;&#x5411;&#x4E8E;&#x9009;&#x62E9;&#x66F4;&#x9AD8;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x8FD9;&#x79CD;&#x81EA;&#x7136;&#x7684;&#x8D39;&#x7528;&#x9009;&#x62E9;&#x65B9;&#x6CD5;&#x88AB;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x6709;&#x4E09;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#xFF1A;&#x9AD8;&#x62E5;&#x5835;&#x3001;&#x9AD8;&#x8D39;&#x7528;&#x548C;&#x6FC0;&#x52B1;&#x4E0D;&#x76F8;&#x5BB9;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x540E;&#x679C;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Congestion</strong> \(\quad\) Current fee systems contribute critically to congestion. Intuitively, this happens because current mechanisms incentivize validators to choose which transactions to confirm based on transaction fees; this in turn forces users to pay to bypass congestion at equilibrium. To make this statement precise, consider a simpli&#xFB01;ed system in which new blocks are produced as a Poisson process of rate \(&#xB5;\), each of which can contain up to \(K\) transactions. Transactions arrive in the system at rate \(&#x3BB;\), and each transaction offers a transaction fee \(b\), chosen by the user. Let \(c\) denote the (random) cost per unit time of delaying a transaction&#x2019;s confirmation, with \(c \sim F[0, \overline{c}]\), where \(\overline{c}\) is a positive constant. So if a single transaction&#x2019;s confirmation is delayed by time \(\Delta\), a delay cost of \(c \Delta\) is incurred. Here \(F(\cdot)\) denotes a cdf with density \(f(\cdot)\) and tail probability \(\overline{F}(c) := 1 - F(c)\).The congestion in the system \(&#x3C1;\) is defined as \(\rho := \frac {\lambda} {\mu K}\). Let \(W_K (&#x3C1;)\) denote the expected transaction confirmation delay in a system (in blocks) with block size \(K\) and congestion \(&#x3C1;\), \(R_K (&#x3C1;)\) the total revenue per unit time raised from users, and \(D_K (&#x3C1;)\) the total delay cost incurred per unit time. Consider the following result by Huberman et al.:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x62E5; &#x5835;</strong> \(\quad\) &#x76EE;&#x524D;&#x7684;&#x6536;&#x8D39;&#x7CFB;&#x7EDF;&#x662F;&#x5F15;&#x8D77;&#x62E5;&#x5835;&#x7684;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#x3002;&#x76F4;&#x89C2;&#x6765;&#x8BB2;&#xFF0C;&#x53D1;&#x751F;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x7684;&#x673A;&#x5236;&#x9F13;&#x52B1;&#x9A8C;&#x8BC1;&#x8005;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x5927;&#x5C0F;&#x53BB;&#x9009;&#x62E9;&#x8981;&#x786E;&#x8BA4;&#x54EA;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF1B;&#x8FD9;&#x76F8;&#x5E94;&#x5730;&#x5C31;&#x4F1A;&#x5F3A;&#x8FEB;&#x7528;&#x6237;&#x5728;&#x5E73;&#x8861;&#x72B6;&#x6001;&#x65F6;&#x8981;&#x4E3A;&#x4E86;&#x7ED5;&#x8FC7;&#x62E5;&#x5835;&#x800C;&#x652F;&#x4ED8;&#x6210;&#x672C;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x8FD9;&#x4E2A;&#x63CF;&#x8FF0;&#x66F4;&#x52A0;&#x7684;&#x51C6;&#x786E;&#xFF0C;&#x8003;&#x8651;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x4E2D;&#x65B0;&#x533A;&#x5757;&#x7684;&#x4EA7;&#x751F;&#x662F;&#x4E00;&#x4E2A;&#x901F;&#x7387;&#x4E3A; \(&#x3BC;\) &#x7684;&#x6CCA;&#x677E;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x53EF;&#x4EE5;&#x5BB9;&#x7EB3;&#x591A;&#x8FBE; \(K\) &#x7B14;&#x4EA4;&#x6613;&#x3002;&#x4EA4;&#x6613;&#x4EE5; \(&#x3BB;\) &#x7684;&#x901F;&#x5EA6;&#x5230;&#x8FBE;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x63D0;&#x4F9B;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x662F; \(b\)&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x7528;&#x6237;&#x9009;&#x62E9;&#x7684;&#x3002;&#x7528; \(c\) &#x8868;&#x793A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x7684;&#xFF08;&#x968F;&#x673A;&#xFF09;&#x6210;&#x672C;&#xFF0C;&#x800C; \(c \sim F[0, \overline{c}]\)&#xFF0C;&#x5176;&#x4E2D; \(\overline{c}\)&#x4E3A;&#x6B63;&#x5E38;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x5355;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x662F; \(\Delta\)&#xFF0C;&#x5219;&#x4F1A;&#x4EA7;&#x751F; \(c \Delta\) &#x7684;&#x5EF6;&#x8FDF;&#x6210;&#x672C;&#x3002;&#x8FD9;&#x91CC;&#x7684; \(F(\cdot)\) &#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5BC6;&#x5EA6;&#x4E3A; \(f(\cdot)\)&#x3001;&#x5C3E;&#x90E8;&#x6982;&#x7387;&#x4E3A; \(\overline{F}(c) := 1 - F(c)\) &#x7684;&#x7D2F;&#x79EF;&#x5206;&#x5E03;&#x51FD;&#x6570;&#xFF08;CDF&#xFF09;&#x3002;&#x7CFB;&#x7EDF;&#x7684;&#x5BC6;&#x96C6;&#x5EA6; \(&#x3C1;\) &#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;\(\rho := \frac {\lambda} {\mu K}\) &#x3002;&#x6211;&#x4EEC;&#x7528; \(W_K (&#x3C1;)\) &#x8868;&#x793A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5BB9;&#x91CF;&#x4E3A; \(K\)&#x3001;&#x5BC6;&#x96C6;&#x5EA6;&#x4E3A; \(&#x3C1;\) &#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x9884;&#x671F;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x5EF6;&#x8FDF;&#xFF0C;\(R_K (&#x3C1;)\) &#x8868;&#x793A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x4ECE;&#x7528;&#x6237;&#x5904;&#x83B7;&#x5F97;&#x7684;&#x603B;&#x6536;&#x76CA;&#xFF0C;\(D_K (&#x3C1;)\) &#x8868;&#x793A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x4EA7;&#x751F;&#x7684;&#x603B;&#x5EF6;&#x8FDF;&#x6210;&#x672C;&#x3002;&#x4EE5;&#x4E0B;&#x662F;Gur Huberman&#x7B49;&#x4EBA;&#x7684;&#x4E00;&#x4E9B;&#x7ED3;&#x8BBA;&#xFF1A;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Theorem 3 ([94]).</strong> \(\quad\) At equilibrium, if \(&#x3C1; = 0\), both revenue and delay cost are \(0\). For all \(&#x3C1; \in (0,1)\),</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5B9A; &#x7406; \(3\) ([94])</strong> \(\quad\)  &#x5728;&#x5747;&#x8861;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x5BC6;&#x96C6;&#x5EA6; \(&#x3C1; = 0\)&#xFF0C;&#x6536;&#x76CA;&#x548C;&#x5EF6;&#x8FDF;&#x6210;&#x672C;&#x90FD;&#x662F; \(0\)&#x3002;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684; \(&#x3C1; \in (0,1)\)&#x3002;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\begin{aligned} R_{K}^{\prime}(\rho) &amp;=K \rho \int_{0}^{\overline{c}} \overline{F}(c)^{2} W_{K}^{\prime}(\rho \overline{F}(c)) d c&gt;0, \\ D_{K}^{\prime}(\rho) &amp;=\frac{R_{K}(\rho)+D_{K}(\rho)}{\rho}&gt;0. \end{aligned}
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In other words, both revenue (and with it infrastructure provision by miners) and delay cost are strictly increasing in \(&#x3C1;\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x6536;&#x76CA;&#xFF08;&#x8FDE;&#x5E26;&#x77FF;&#x5DE5;&#x63D0;&#x4F9B;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF09;&#x548C;&#x5EF6;&#x8FDF;&#x6210;&#x672C;&#x662F;&#x968F;&#x7740;&#x5BC6;&#x96C6;&#x5EA6; \(&#x3C1;\) &#x800C;&#x4E25;&#x683C;&#x9012;&#x589E;&#x7684;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="dlist">
<dl>
<dt class="hdlist1">A primary, troubling repercussion of this result is that congestion is not merely a side effect of technical scalability challenges. Rather, it is fundamental; validators are not incentivized to work without congestion. As stated in [94]: </dt>
<dd>
<p>An implication of [Theorem 3] is that congestion and delays are necessary for the system to function. Low congestion &#x3C1; leads to low delay costs, as blocks are rarely full and each transaction is likely to be processed in the next block. But when blocks are rarely full users have little incentive to pay transaction fees to gain priority, and the system raises little revenue. Without sufficient revenue the number of miners&#x2026;can become too small, making the system unreliable.</p>
</dd>
</dl>
</div>
</blockquote>
</div>
<div class="dlist">
<dl>
<dt class="hdlist1">&#x8FD9;&#x4E00;&#x7ED3;&#x679C;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x3001;&#x4EE4;&#x4EBA;&#x5FE7;&#x8651;&#x7684;&#x5F71;&#x54CD;&#x662F;&#xFF0C;&#x62E5;&#x5835;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x6311;&#x6218;&#x7684;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x662F;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#xFF1B;&#x5728;&#x6CA1;&#x6709;&#x62E5;&#x5835;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x5C31;&#x6CA1;&#x6709;&#x5DE5;&#x4F5C;&#x7684;&#x52A8;&#x529B;&#x3002;&#x5982;[94]&#x6240;&#x8FF0;&#xFF1A; </dt>
<dd>
<p>&#x3010;&#x5B9A;&#x7406;3&#x3011;&#x7684;&#x4E00;&#x4E2A;&#x542B;&#x4E49;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x884C;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x62E5;&#x5835;&#x548C;&#x5EF6;&#x8FDF;&#x3002;&#x4F4E;&#x5BC6;&#x96C6;&#x5EA6; \(&#x3C1;\) &#x5BFC;&#x81F4;&#x4F4E;&#x5EF6;&#x8FDF;&#x6210;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x5F88;&#x5C11;&#x662F;&#x6EE1;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x53EF;&#x80FD;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x5757;&#x4E2D;&#x5904;&#x7406;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x6570;&#x636E;&#x533A;&#x5757;&#x5F88;&#x5C11;&#x662F;&#x6EE1;&#x7684;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x5F88;&#x5C11;&#x6709;&#x52A8;&#x529B;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4EE5;&#x83B7;&#x5F97;&#x4F18;&#x5148;&#x6743;&#xFF0C;&#x800C;&#x7CFB;&#x7EDF;&#x4E5F;&#x5F88;&#x5C11;&#x589E;&#x52A0;&#x6536;&#x5165;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6536;&#x5165;&#xFF0C;&#x77FF;&#x5DE5;&#x7684;&#x6570;&#x91CF;&#x2026;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5F97;&#x592A;&#x5C0F;&#xFF0C;&#x4F7F;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x9760;&#x3002;</p>
</dd>
</dl>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This instability among miners under low congestion conditions is discussed more carefully when we consider incentive compatibility. We want to highlight that although [94] was written for the PoW setting, their results are not specific to PoW. Rather, they stem from the combination of three factors: (1) blocks are produced at a constant rate with a limited block size, (2) different transactions give miners (proposers) di&#xFB00;erent reward amounts, and (3) miners get to choose which transactions to include in each block. If a similar fee mechanism were adopted in a PoS system, the same effects would emerge, due to the fact that block times are lower bounded (by protocol and/or by physical constraints). This fundamental relation between congestion and user-selected fees is problematic in a high-throughput payment system.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5728;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x6FC0;&#x52B1;&#x76F8;&#x5BB9;&#x6027;&#x65F6;&#xFF0C;&#x66F4;&#x4ED4;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x4E86;&#x4F4E;&#x62E5;&#x5835;&#x6761;&#x4EF6;&#x4E0B;&#x77FF;&#x5DE5;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1; [94] &#x662F;&#x4E3A;PoW&#x8BBE;&#x7F6E;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x7ED3;&#x679C;&#x5E76;&#x4E0D;&#x662F;&#x53EA;&#x7279;&#x5B9A;&#x4E8E;PoW&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x7531;&#x4E09;&#x4E2A;&#x56E0;&#x7D20;&#x7EC4;&#x5408;&#x800C;&#x6210;&#x7684;&#xFF1A;&#xFF08;1&#xFF09;&#x533A;&#x5757;&#x4EE5;&#x56FA;&#x5B9A;&#x7684;&#x901F;&#x5EA6;&#x751F;&#x4EA7;&#xFF0C;&#x4E14;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x6709;&#x9650;&#xFF1B;&#xFF08;2&#xFF09;&#x4E0D;&#x540C;&#x7684;&#x4EA4;&#x6613;&#x7ED9;&#x77FF;&#x5DE5;&#xFF08;&#x51FA;&#x5757;&#x8005;&#xFF09;&#x4E0D;&#x540C;&#x7684;&#x5956;&#x52B1;&#x91D1;&#x989D;&#xFF1B;&#xFF08;3&#xFF09;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5728;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;POS&#x7CFB;&#x7EDF;&#x4E2D;&#x91C7;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x6536;&#x8D39;&#x673A;&#x5236;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x4E8B;&#x5B9E;&#x4E0A;PoS&#x7CFB;&#x7EDF;&#x91CC;&#x533A;&#x5757;&#x65F6;&#x95F4;&#x7684;&#x9650;&#x5236;&#x8F83;&#x4F4E;&#xFF08;&#x53D7;&#x534F;&#x8BAE;&#x548C;/&#x6216;&#x7269;&#x7406;&#x7EA6;&#x675F;&#xFF09;&#x3002;&#x5728;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x62E5;&#x5835;&#x4E0E;&#x7528;&#x6237;&#x9009;&#x62E9;&#x8D39;&#x7528;&#x4E4B;&#x95F4;&#x7684;&#x8FD9;&#x79CD;&#x57FA;&#x672C;&#x5173;&#x7CFB;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>High fees</strong> \(\quad\) Another substantial problem with the current fee structure is that fees can be unbounded. Consider the following result from Huberman et al., which considers the same model from the prior discussion on congestion:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x9AD8;&#x624B;&#x7EED;&#x8D39;</strong> \(\quad\) &#x5F53;&#x524D;&#x7684;&#x8D39;&#x7528;&#x7ED3;&#x6784;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5B9E;&#x8D28;&#x6027;&#x95EE;&#x9898;&#x662F;&#x8D39;&#x7528;&#x53EF;&#x4EE5;&#x4E0D;&#x53D7;&#x9650;&#x5236;&#x3002;&#x8003;&#x8651;Huberman&#x7B49;&#x4EBA;&#x5F97;&#x51FA;&#x7684;&#x4EE5;&#x4E0B;&#x7ED3;&#x679C;&#xFF0C;&#x8BE5;&#x7ED3;&#x679C;&#x8003;&#x8651;&#x4E86;&#x4E4B;&#x524D;&#x5173;&#x4E8E;&#x62E5;&#x5835;&#x7684;&#x8BA8;&#x8BBA;&#x5F97;&#x51FA;&#x7684;&#x76F8;&#x540C;&#x6A21;&#x578B;&#xFF1A;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Theorem 4 ([94]).</strong> \(\quad\) At equilibrium, transaction fees coincide with the payments that result from selling priority of service in a Vickrey-Clark-Groves (VCG) auction.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5B9A;&#x7406;4&#xFF08;[94]&#xFF09;</strong> \(\quad\) &#x5728;&#x5747;&#x8861;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E0E;&#x7EF4;&#x514B;&#x91CC;&#xFF08;VCG&#xFF09;&#x62CD;&#x5356;&#x4E2D;&#x4E3A;&#x9500;&#x552E;&#x4F18;&#x5148;&#x670D;&#x52A1;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#x662F;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>A well-known property of VCG auctions is that participants are incentivized to bid an amount equal to the externality they impose upon others. This may not be problematic on average, but these amounts can become arti&#xFB01;cially inflated due to social factors, world events, random fluctuations in system load, etc. Indeed, in December of 2017, Bitcoin fees exceeded $20 per transaction [92]. This volatility and unboundedness is explicitly at odds with the requirements of a payment system. Merchant adoption hinges critically on the guarantee that fees will not grow beyond a maximum threshold; this point has been touted as a primary reason why cryptocurrencies can never replace fiat money [164].</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>VCG&#x62CD;&#x5356;&#x7684;&#x4E00;&#x4E2A;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x53C2;&#x4E0E;&#x8005;&#x88AB;&#x6FC0;&#x52B1;&#x51FA;&#x4EF7;&#xFF0C;&#x5176;&#x91D1;&#x989D;&#x7B49;&#x4E8E;&#x4ED6;&#x4EEC;&#x5F3A;&#x52A0;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5916;&#x90E8;&#x6548;&#x5E94;&#x3002;&#x5E73;&#x5747;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x793E;&#x4F1A;&#x56E0;&#x7D20;&#x3001;&#x4E16;&#x754C;&#x4E8B;&#x4EF6;&#x3001;&#x7CFB;&#x7EDF;&#x8D1F;&#x8F7D;&#x7684;&#x968F;&#x673A;&#x6CE2;&#x52A8;&#x7B49;&#x539F;&#x56E0;&#xFF0C;&#x8FD9;&#x4E9B;&#x91D1;&#x989D;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x4EBA;&#x4E3A;&#x81A8;&#x80C0;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;2017&#x5E74;12&#x6708;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6536;&#x8D39;&#x4E00;&#x5EA6;&#x8D85;&#x8FC7;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;20&#x7F8E;&#x5143;[92]&#x3002;&#x8FD9;&#x79CD;&#x6CE2;&#x52A8;&#x6027;&#x548C;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x663E;&#x7136;&#x4E0E;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x7684;&#x8981;&#x6C42;&#x4E0D;&#x7B26;&#x3002;&#x5546;&#x5BB6;&#x7684;&#x91C7;&#x7528;&#x4E3B;&#x8981;&#x53D6;&#x51B3;&#x4E8E;&#x4FDD;&#x8BC1;&#x8D39;&#x7528;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x6700;&#x5927;&#x9608;&#x503C;&#xFF1B;&#x8FD9;&#x4E00;&#x70B9;&#x5DF2;&#x7ECF;&#x88AB;&#x5439;&#x6367;&#x4E3A;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x53D6;&#x4EE3;&#x6CD5;&#x5E01;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;[164]&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>A key observation is that whereas congestion arises mainly because of the way fees are disbursed, high or volatile fees result from a combination of two factors: first, fees are proposed by users. Second, validators receive higher rewards for transactions with higher fees, and choose which transactions to include. It is this combination that leads to the VCG result, which in turn leads to unpredictable fees. Hence, any solution to this problem should tackle both factors; it is not enough to simply change the way that fees are disbursed.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x6CE8;&#x610F;&#x70B9;&#x662F;&#xFF0C;&#x9274;&#x4E8E;&#x62E5;&#x5835;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x4EA4;&#x6613;&#x8D39;&#x7684;&#x652F;&#x4ED8;&#x65B9;&#x5F0F;&#x9020;&#x6210;&#x7684;&#xFF0C;&#x9AD8;&#x6216;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x8D39;&#x7528;&#x662F;&#x7531;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#x7684;&#x7EFC;&#x5408;&#x9020;&#x6210;&#x7684;&#x7ED3;&#x679C;&#xFF1A;<strong>&#x7B2C;&#x4E00;&#xFF0C;&#x8D39;&#x7528;&#x662F;&#x7531;&#x7528;&#x6237;&#x63D0;&#x51FA;&#x7684;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x53EF;&#x4EE5;&#x4ECE;&#x6536;&#x8D39;&#x8F83;&#x9AD8;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x5956;&#x52B1;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8981;&#x6253;&#x5305;&#x54EA;&#x4E9B;&#x4EA4;&#x6613;</strong>&#x3002;&#x6B63;&#x662F;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x7ED3;&#x5408;&#x5BFC;&#x81F4;&#x4E86; VCG &#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4E86;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x8D39;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EFB;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x5E94;&#x8BE5;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x8FD9;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#xFF1B;&#x4EC5;&#x4EC5;&#x6539;&#x53D8;&#x8D39;&#x7528;&#x7684;&#x652F;&#x4ED8;&#x65B9;&#x5F0F;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Incentive incompatibility</strong> \(\quad\) A third critical repercussion of the current approach to transaction fee management is incentive incompatibility. In particular, in underutilized systems, it can introduce undesirable equilibria in terms of proposal strategies. Carlsten et al. show that in the absence of inflation, rational Bitcoin miners are no longer incentivized to mine on the longest chain [40]. The intuition is that if miners are only collecting transaction fees, then they are incentivized to include as many transactions as possible in each block. This means that right after a block is mined, the number of transactions available for inclusion in the next block is minimal, as is the associated reward. Thus, when choosing between forks, miners are incentivized to adopt one with fewer transactions in the final block, since such forks leave more transaction fees for the next miner. By exploiting this observation, selfish miners can convince other miners to build on side chains.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x6FC0;&#x52B1;&#x4E0D;&#x76F8;&#x5BB9;</strong> \(\quad\) &#x5F53;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x91CD;&#x8981;&#x5F71;&#x54CD;&#x662F;&#x6FC0;&#x52B1;&#x4E0D;&#x76F8;&#x5BB9;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5728;&#x672A;&#x5145;&#x5206;&#x5229;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x63D0;&#x6848;&#x7B56;&#x7565;&#x65B9;&#x9762;&#x5F15;&#x8D77;&#x4E00;&#x4E9B;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5E73;&#x8861;&#x3002;Carlsten&#x7B49;&#x4EBA;&#x8868;&#x660E;&#x5728;&#x6CA1;&#x6709;&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7406;&#x6027;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x77FF;&#x5DE5;&#x4E0D;&#x518D;&#x88AB;&#x6FC0;&#x52B1;&#x5230;&#x6700;&#x957F;&#x94FE;&#x4E0A;&#x6316;&#x77FF;[40]&#x3002;&#x76F4;&#x89C9;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x77FF;&#x5DE5;&#x53EA;&#x6536;&#x53D6;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x4F1A;&#x88AB;&#x6FC0;&#x52B1;&#x5728;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x6253;&#x5305;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x521A;&#x88AB;&#x6316;&#x51FA;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x662F;&#x6700;&#x5C0F;&#x7684;&#xFF0C;&#x76F8;&#x5173;&#x7684;&#x5956;&#x52B1;&#x4E5F;&#x662F;&#x6700;&#x5C0F;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x53C9;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x65F6;&#xFF0C;&#x77FF;&#x5DE5;&#x88AB;&#x9F13;&#x52B1;&#x91C7;&#x7528;&#x6700;&#x7EC8;&#x533A;&#x5757;&#x4E2D;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x8F83;&#x5C11;&#x7684;&#x5206;&#x53C9;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x7C7B;&#x5206;&#x53C9;&#x4F1A;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x7559;&#x4E0B;&#x66F4;&#x591A;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x901A;&#x8FC7;&#x5229;&#x7528;&#x8FD9;&#x79CD;&#x8A00;&#x8BBA;&#xFF0C;&#x81EA;&#x79C1;&#x6316;&#x77FF;&#x8005;&#x53EF;&#x4EE5;&#x8BF4;&#x670D;&#x5176;&#x4ED6;&#x77FF;&#x5DE5;&#x5EFA;&#x7ACB;&#x4FA7;&#x94FE;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>More precisely, [40] shows the existence of equilibria that do not involve honest mining. Their model is as follows: consider a constant stream of incoming transactions. For any time interval \(\mathcal {T} = [t_1,t_2]\), let  \(g(\mathcal {T}) = t_2 - t_1\) denote the fees accumulated by the transactions in interval \(\mathcal {T}\) (i.e. one unit of fees per unit time). Notice that the model considers transactions as continuous quantities that can be infinitesimally split between miners. Because of the one-to-one correspondence between transaction times and associated fees, we will interchangeably allow \(\mathcal {T}\) to denote both a time interval and a set of transactions; the meaning should be clear from context. Suppose there is no network latency, and no limit on block size (equivalently, there are few enough transactions in the system that a miner can always include all outstanding transactions in the next block). For a block \(B\), let \(o_B\) denote the node that proposed block \(B\). A key assumption is that when a miner mines a block at time t on block \(B\), it can choose to include any subset \(\mathcal{T}^{\prime} \subseteq[0, t]\) of outstanding transactions in the new block, thereby collecting fees \(g(\mathcal{T}^{\prime}) = \left|\mathcal{T}^{\prime}\right|\). Let \(L_B (t)\) denote the amount of outstanding transactions in interval \([0,t]\), i.e., transactions that have not been claimed by \(B\) or its predecessors. For an amount of outstanding transactions \(L_B (t)\), suppose agents use function \(f(L_B (t))\) to determine how many transactions to consume in the next block. The authors also assume that if the chain has height \(H\), a miner will either build on the chain at height \(H+1\) or fork the last block, and build a conflicting block at height \(H\); let \(H_B\) denote the height of block \(B\). Let \(M_H\) denote the block at height \(H\) that leaves the most unclaimed transactions, i.e.,</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;[40]&#x663E;&#x793A;&#x4E86;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x4E0D;&#x6D89;&#x53CA;&#x8BDA;&#x5B9E;&#x91C7;&#x77FF;&#x7684;&#x5E73;&#x8861;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x5982;&#x4E0B;&#xFF1A;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x6301;&#x7EED;&#x7684;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x6D41;&#x3002;&#x5728;&#x4EFB;&#x610F;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694; \(\mathcal {T} = [t_1,t_2]\) &#xFF0C;&#x6211;&#x4EEC;&#x7528; \(g(\mathcal {T}) = t_2 - t_1\) &#x8868;&#x793A;&#x5728;&#x65F6;&#x95F4;&#x95F4;&#x9694; \(T\) &#x5185;&#x7684;&#x4EA4;&#x6613;&#x6240;&#x7D2F;&#x79EF;&#x7684;&#x8D39;&#x7528;&#xFF08;&#x5373;&#x6BCF;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x6536;&#x53D6;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x7684;&#x8D39;&#x7528;&#xFF09;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x5C06;&#x4EA4;&#x6613;&#x770B;&#x4F5C;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x77FF;&#x5DE5;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x65E0;&#x9650;&#x5C0F;&#x5206;&#x5272;&#x7684;&#x8FDE;&#x7EED;&#x6570;&#x91CF;&#x3002;&#x7531;&#x4E8E;&#x4EA4;&#x6613;&#x65F6;&#x95F4;&#x548C;&#x76F8;&#x5173;&#x8D39;&#x7528;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x5BF9;&#x4E00;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5141;&#x8BB8; \(T\) &#x53EF;&#x4E92;&#x6362;&#x5730;&#x53BB;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x548C;&#x4E00;&#x7EC4;&#x4EA4;&#x6613;&#xFF1B;&#x5176;&#x542B;&#x4E49;&#x5E94;&#x4ECE;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x660E;&#x786E;&#x3002;&#x5047;&#x8BBE;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5BF9;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x7684;&#x9650;&#x5236;&#xFF08;&#x76F8;&#x5F53;&#x4E8E;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x8DB3;&#x591F;&#x5C11;&#xFF0C;&#x77FF;&#x5DE5;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x6240;&#x6709;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x4EA4;&#x6613;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x533A;&#x5757; \(B\)&#xFF0C;&#x6211;&#x4EEC;&#x7528; \(o_B\) &#x6765;&#x4EE3;&#x8868;&#x4E3A;&#x533A;&#x5757; \(B\) &#x505A;&#x63D0;&#x6848;&#x7684;&#x8282;&#x70B9;&#x3002;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x5047;&#x8BBE;&#x662F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x5728;&#x65F6;&#x95F4;t&#x5185;&#x4ECE;&#x533A;&#x5757; \(B\) &#x4E0A;&#x6316;&#x51FA;&#x4E00;&#x4E2A;&#x5757;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5728;&#x65B0;&#x7684;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x672A;&#x5B8C;&#x6210;&#x4EA4;&#x6613;&#x7684;&#x5B50;&#x96C6; \(\mathcal{T}^{\prime} \subseteq[0, t]\)&#xFF08;&#x5373;&#x65F6;&#x95F4;&#x533A;&#x95F4;\([0,t]\)&#x5185;&#x7684;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x7EC4;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x6536;&#x53D6;&#x8D39;&#x7528; \(g(\mathcal{T}^{\prime}) = \left|\mathcal{T}^{\prime}\right|\)&#x3002;&#x6211;&#x4EEC;&#x7528; \(L_B (t)\) &#x6765;&#x8868;&#x793A;&#x65F6;&#x95F4;&#x95F4;&#x9694; \([0,t]\) &#x5185;&#x672A;&#x5B8C;&#x6210;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x8FD8;&#x672A;&#x88AB;&#x533A;&#x5757;B&#x6216;&#x5176;&#x7236;&#x5757;&#x5E7F;&#x64AD;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x91CF;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x4EA4;&#x6613; \(L_B (t)\)&#xFF0C;&#x5047;&#x8BBE;&#x4EE3;&#x7406;&#x4F7F;&#x7528;&#x51FD;&#x6570; \(f(L_B (t))\) &#x6765;&#x786E;&#x5B9A;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x8981;&#x6D88;&#x8017;&#x591A;&#x5C11;&#x4EA4;&#x6613;&#x3002;&#x4F5C;&#x8005;&#x8FD8;&#x5047;&#x8BBE;&#xFF0C;&#x5982;&#x679C;&#x94FE;&#x7684;&#x9AD8;&#x5EA6;&#x4E3A; \(H\)&#xFF0C; &#x77FF;&#x5DE5;&#x8981;&#x4E48;&#x5728;&#x94FE;&#x9AD8;&#x5EA6; \(H+1\) &#x4E0A;&#x5EFA;&#x7ACB;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x8981;&#x4E48;&#x5206;&#x53C9;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5728;&#x9AD8;&#x5EA6;\(H\) &#x5EFA;&#x9020;&#x4E00;&#x4E2A;&#x4E89;&#x8BAE;&#x533A;&#x5757;&#xFF1B;&#x7528;\(H_B\) &#x6765;&#x8868;&#x793A;&#x533A;&#x5757; \(B\) &#x7684;&#x9AD8;&#x5EA6;&#x3002;&#x7528; \(M_H\) &#x6765;&#x8868;&#x793A;&#x5728;&#x5757;&#x9AD8;&#x5EA6;&#x4E3A; \(H\) &#x65F6;&#x7559;&#x4E0B;&#x6700;&#x5927;&#x672A;&#x5E7F;&#x64AD;&#x4EA4;&#x6613;&#x7684;&#x90A3;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5373;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
M_{H} = \arg \max_{B} \{L_{B}(t) : H_{B} = H \}.
\end{equation}</p>
</div>
<div class="paragraph">
<p>&#xFF08;&#x5373; \(M_H\) &#x5C31;&#x662F;&#x5728;&#x533A;&#x5757;&#x9AD8;&#x5EA6; \(H_B=H\)&#x3001;&#x4F7F;&#x5F97;&#x51FD;&#x6570; \(L_B (t)\) &#x53D6;&#x5F97;&#x6700;&#x5927;&#x503C;&#x7684;&#x90A3;&#x4E2A;&#x533A;&#x5757; \(B\)&#xFF0C;&#x533A;&#x5757; \(B\) &#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6CDB;&#x6307;&#x7684;&#x533A;&#x5757;&#x3002;&#xFF09;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Similarly, let \(G_H (t) = L_{M_{H-1}} (t) - L_{M_H} (t)\) denote the gap between the most unclaimed fees available at height \(H-1\) and the most unclaimed fees at height \(H\). [40] considers a class of strategies where each miner chooses (a) which block to build on, and (b) how many transactions to consume in their block. Algorithm 1 describes this procedure.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x7528; \(G_H (t) = L_{M_{H-1}} (t) - L_{M_H} (t)\) &#x8868;&#x793A;&#x5728;&#x5757;&#x9AD8;&#x5EA6; \(H-1\) &#x7684;&#x6700;&#x5927;&#x672A;&#x5E7F;&#x64AD;&#x8D39;&#x7528;&#x4E0E;&#x5728;&#x9AD8;&#x5EA6; \(H\) &#x7684;&#x6700;&#x5927;&#x672A;&#x5E7F;&#x64AD;&#x8D39;&#x7528;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x989D;&#x3002;[40]&#x8003;&#x8651;&#x4E86;&#x4E00;&#x7C7B;&#x7B56;&#x7565;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x9009;&#x62E9;&#xFF08;a&#xFF09;&#x5728;&#x54EA;&#x4E2A;&#x5757;&#x4E0A;&#x6784;&#x5EFA;&#x65B0;&#x5757;&#xFF0C;&#x4EE5;&#x53CA;&#xFF08;b&#xFF09;&#x5728;&#x5176;&#x5757;&#x4E2D;&#x6D88;&#x8017;&#x591A;&#x5C11;&#x4EA4;&#x6613;&#x3002;&#x7B97;&#x6CD5; \(1\) &#x6B63;&#x597D;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p>
</div>
<div class="paragraph">
<p><span class="image"><img src="icons/Algorithm_1.png" alt="Algorithm_1"></span></p>
</div>
<div class="paragraph">
<p><strong>Theorem 5 ([40]).</strong> \(\quad\) For any constant \(y\) such that \(2 y - \ln (y) \geq 2\), define</p>
</div>
<div class="paragraph">
<p><strong>&#x5B9A; &#x7406; 5&#xFF08;[40]&#xFF09;.</strong> \(\quad\) &#x5BF9;&#x4E8E;&#x6EE1;&#x8DB3; \(2 y - \ln (y) \geq 2\) &#x7684;&#x4EFB;&#x610F;&#x5E38;&#x6570; \(y\)&#xFF0C;&#x5B9A;&#x4E49;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
f(x) = \left \{ \begin{array}{ll}{x} &amp; {\text { if } x \leq y} \\ {-W_{0} \left(-y e^{x-2 y}\right)} &amp; {\text { if } x \in (y, 2 y-\ln (y)-1)} \\ {1} &amp; {\text { else }}\end{array}\right.
\quad \quad \quad \quad \quad \quad (7.24)
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>where \(W_0 (&#xB7;)\) denotes the upper branch of the Lambert W function which satisfies \(W_0 (x e^x )=x\) for all \(x \in\left[-\frac{1}{e}, \infty\right)\). Then it is an equilibrium for every miner to mine with strategy Function-fork(\(f\)) (Algorithm 1) as long as every miner is non-atomic, and miners only mine on top of chains of length \(H\) or \(H &#x2212; 1\), where \(H\) denotes the length of the longest chain in the system. Furthermore, in such an equilibrium, the expected number of unconfirmed transactions at time \(n \in \mathbb{R}\) scales as \(\Omega(\sqrt{n})\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5F0F;&#x4E2D;&#xFF0C;\(W_0 (&#xB7;)\) &#x8868;&#x793A; Lambert W &#x51FD;&#x6570;&#x7684;&#x4E0A;&#x5206;&#x652F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684; \(x \in\left[-\frac{1}{e}, \infty\right)\)&#xFF0C;&#x5B83;&#x6EE1;&#x8DB3; \(W_0 (x e^x )=x\)&#x3002;&#x7136;&#x540E;&#xFF0C;&#x4F7F;&#x7528;fork&#x51FD;&#x6570;\(f\)&#x4F5C;&#x4E3A;&#x6316;&#x77FF;&#x7B56;&#x7565;&#xFF08;&#x7B97;&#x6CD5;1&#xFF09;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x5E73;&#x8861;&#xFF0C;&#x53EA;&#x8981;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x90FD;&#x662F;&#x975E;&#x539F;&#x5B50;&#x7EA7;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x77FF;&#x5DE5;&#x4EEC;&#x53EA;&#x5728;&#x94FE;&#x957F;&#x5EA6; \(H\) &#x6216;&#x8005; \(H-1\) &#x4E0A;&#x6316;&#x77FF;&#xFF0C;&#x5176;&#x4E2D;H&#x4EE3;&#x8868;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x957F;&#x94FE;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x5747;&#x8861;&#x4E2D;&#xFF0C;&#x5728;&#x65F6;&#x95F4; \(n \in \mathbb{R}\) &#x5185;&#xFF0C;&#x672A;&#x786E;&#x8BA4;&#x4EA4;&#x6613;&#x7684;&#x9884;&#x671F;&#x6570;&#x91CF;&#x7528; \(\Omega(\sqrt{n})\) &#x6765;&#x8861;&#x91CF;&#x3002;</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top"></th>
<th class="tableblock halign-left valign-top">Miner gets full \(\ \) transaction fees</th>
<th class="tableblock halign-left valign-top">Delcoupled rewards</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">User-selected \(\ \) fees</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Bitcoin [130] \(\ \) Ethereum [186]</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Cardano [101,100] \(\ \) Fruitchains [137]</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Algorithmic \(\ \) fees</p></td>
<td class="tableblock halign-left valign-top"></td>
<td class="tableblock halign-left valign-top"></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p><span class="small">Table 7.1: Design space for transaction fee mechanisms. To the best of our knowledge, no blockchain systems today chooses transaction fees purely algorithmically. That being said, several cryptocurrencies impose algorithmic lower bounds on fees, but allow users to offer higher fees if desired (e.g., Bitcoin, Cardano, Ethereum).
&#xFF08;&#x8868;7.1&#xFF1A;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x673A;&#x5236;&#x7684;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#x3002;&#x636E;&#x6211;&#x4EEC;&#x6240;&#x77E5;&#xFF0C;&#x76EE;&#x524D;&#x6CA1;&#x6709;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x7EAF;&#x7CB9;&#x662F;&#x4ECE;&#x7B97;&#x6CD5;&#x4E0A;&#x9009;&#x62E9;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E00;&#x4E9B;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x5BF9;&#x8D39;&#x7528;&#x65BD;&#x52A0;&#x7B97;&#x6CD5;&#x4E0B;&#x9650;&#xFF0C;&#x4F46;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6839;&#x636E;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7684;&#x8D39;&#x7528;&#xFF08;&#x5982;&#x6BD4;&#x7279;&#x5E01;&#x3001;&#x827E;&#x8FBE;&#x5E01;&#x3001;&#x4EE5;&#x592A;&#x574A;&#xFF09;&#x3002;&#xFF09;</span></p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This theorem suggests that Bitcoin is not stable when miners are incentivized only with transaction fees, whereas block rewards help stabilize the reward against temporal fluctuations in the transaction pool size. The \(\Theta(\sqrt{n})\) transaction backlog is problematic, and the strategic incentives are not just edge cases; the paper shows numerically that honest behavior is itself not a Nash equilibrium. M&#xF6;ser and B&#xF6;hme observe related behavior in a longitudinal measurement of Bitcoin&#x2019;s transaction history [129].</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x4E00;&#x7406;&#x8BBA;&#x6697;&#x793A;&#xFF0C;&#x5F53;&#x53EA;&#x7528;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6765;&#x6FC0;&#x52B1;&#x77FF;&#x5DE5;&#x65F6;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x6709;&#x52A9;&#x4E8E;&#x7A33;&#x5B9A;&#x6316;&#x77FF;&#x56DE;&#x62A5;&#x6765;&#x62B5;&#x6297;&#x4EA4;&#x6613;&#x6C60;&#x89C4;&#x6A21;&#x7684;&#x6682;&#x65F6;&#x6027;&#x6CE2;&#x52A8;&#x3002;\(\Theta(\sqrt{n})\) &#x7684;&#x4EA4;&#x6613;&#x79EF;&#x538B;&#x662F;&#x6210;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x6218;&#x7565;&#x6FC0;&#x52B1;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FB9;&#x7F18;&#x6848;&#x4F8B;&#xFF0C;&#x672C;&#x6587;&#x4ECE;&#x6570;&#x5B57;&#x4E0A;&#x8BF4;&#x660E;&#x8BDA;&#x5B9E;&#x884C;&#x4E3A;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x3002;M&#xF6;ser &#x548C; B&#xF6;hme&#x89C2;&#x5BDF;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x5386;&#x53F2;&#x7EB5;&#x5411;&#x6D4B;&#x91CF;&#x4E2D;&#x7684;&#x76F8;&#x5173;&#x884C;&#x4E3A;[129]&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>As with the results on congestion and fee volatility, this result is not speci&#xFB01;c to PoW. Rather, it results from miners deriving different rewards from different transactions, and hence being incentivized to process high-fee transactions. Broadly, there are two approaches for protecting against the challenges presented in [40]. The first is to ensure that there are always more transactions than there is space in each block: essentially, create congestion. This scenario is prevalent in Bitcoin today, which may help explain why these attacks have not been observed in the wild. However, our goal in adopting PoS is precisely to avoid congestion, especially as a means of network control. A second approach is to decouple block rewards from the transactions they process. We explore such options in the following section.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4E0E;&#x62E5;&#x5835;&#x548C;&#x8D39;&#x7528;&#x6CE2;&#x52A8;&#x7684;&#x7ED3;&#x679C;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E00;&#x7ED3;&#x679C;&#x5E76;&#x4E0D;&#x7279;&#x5B9A;&#x4E8E;PoW&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#x83B7;&#x5F97;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x62A5;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;&#x9F13;&#x52B1;&#x53BB;&#x5904;&#x7406;&#x624B;&#x7EED;&#x8D39;&#x9AD8;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5E7F;&#x6CDB;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x9632;&#x6B62;&#x5728;[40]&#x4E2D;&#x6240;&#x5C55;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x6311;&#x6218;&#x3002;&#x7B2C;&#x4E00;&#x5C31;&#x662F;&#x786E;&#x4FDD;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x603B;&#x662F;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4EA4;&#x6613;&#x800C;&#x4E0D;&#x662F;&#x7A7A;&#x95F4;&#xFF1A;&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x521B;&#x9020;&#x62E5;&#x5835;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x666E;&#x904D;&#x5B58;&#x5728;&#x4E8E;&#x4ECA;&#x5929;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x6709;&#x52A9;&#x4E8E;&#x89E3;&#x91CA;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x91CE;&#x5916;&#x6CA1;&#x6709;&#x89C2;&#x5BDF;&#x5230;&#x8FD9;&#x4E9B;&#x653B;&#x51FB;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x7528;PoS&#x7684;&#x76EE;&#x7684;&#x6070;&#x597D;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x62E5;&#x5835;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x7F51;&#x7EDC;&#x63A7;&#x5236;&#x624B;&#x6BB5;&#x800C;&#x8A00;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x533A;&#x5757;&#x5956;&#x52B1;&#x548C;&#x5176;&#x5904;&#x7406;&#x7684;&#x4EA4;&#x6613;&#x5206;&#x79BB;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x90E8;&#x5206;&#x4E2D;&#x63A2;&#x8BA8;&#x8FD9;&#x4E00;&#x9009;&#x9879;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="_7_3_2_design_considerations">7.3.2  Design considerations&#xFF08;&#x8D39;&#x7528;&#x8BBE;&#x8BA1;&#x8003;&#x8651;&#xFF09;</h3>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The transaction fee structure for Unit-e has not been finalized. We are particularly interested in two main design choices: (1) whether fees are chosen algorithmically or selected by users, and (2) how transaction fees are disseminated to users. This design space is summarized in Table 7.1, along with a partial listing of current cryptocurrencies in each operating point. In this section, we will describe each of the quadrants in Table 7.1 along with the corresponding tradeoffs.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>Unit-E&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7ED3;&#x6784;&#x5C1A;&#x672A;&#x5B9A;&#x7A3F;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x4E24;&#x4E2A;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x7279;&#x522B;&#x611F;&#x5174;&#x8DA3;&#xFF1A;&#xFF08;1&#xFF09;&#x624B;&#x7EED;&#x8D39;&#x662F;&#x6839;&#x636E;&#x7B97;&#x6CD5;&#x9009;&#x62E9;&#x8FD8;&#x662F;&#x7531;&#x7528;&#x6237;&#x9009;&#x62E9;&#xFF1B;&#xFF08;2&#xFF09;&#x5982;&#x4F55;&#x5411;&#x7528;&#x6237;&#x5206;&#x53D1;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x5728;&#x8868;7.1&#x4E2D;&#x603B;&#x7ED3;&#x4E86;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x5F53;&#x524D;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x5728;&#x5404;&#x81EA;&#x64CD;&#x4F5C;&#x70B9;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x5217;&#x4E3E;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53D9;&#x8FF0;&#x8868;7.1&#x7684;&#x6BCF;&#x4E2A;&#x8C61;&#x9650;&#xFF0C;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x6743;&#x8861;&#x3002;</p>
</div>
<div class="sect3">
<h4 id="_7_3_2_1_user_selected_fees_miner_gets_full_transaction_fees">7.3.2.1   User-selected fees, miner gets full transaction fees&#xFF08;&#x7528;&#x6237;&#x9009;&#x62E9;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x77FF;&#x5DE5;&#x83B7;&#x5F97;&#x5168;&#x989D;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF09;</h4>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This operating point is by far the most popular today, being used in Bitcoin, Ethereum, Monero, and others. We discussed the drawbacks of this approach in detail in Section 7.3.1. To summarize, there are three main problems with this approach: (1) it incentivizes miners to create congestion, (2) transaction fees are unbounded, and (3) it is susceptible to strategic behavior. Because of these problems, which have been well-documented both theoretically and in practice, we do not view this operating point as viable for Unit-e.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x70B9;&#x662F;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6700;&#x6D41;&#x884C;&#x7684;&#xFF0C;&#x88AB;&#x7528;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x3001;&#x4EE5;&#x592A;&#x574A;&#x3001;&#x95E8;&#x7F57;&#x5E01;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x7B2C;7.3.1&#x8282;&#x4E2D;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x4E86;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x7F3A;&#x70B9;&#x3002;&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#xFF1A;<strong>&#xFF08;1&#xFF09;&#x6FC0;&#x52B1;&#x77FF;&#x5DE5;&#x5236;&#x9020;&#x62E5;&#x5835;&#xFF1B;&#xFF08;2&#xFF09;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6CA1;&#x6709;&#x9650;&#x5236;&#xFF1B;&#xFF08;3&#xFF09;&#x6613;&#x53D7;&#x6218;&#x7565;&#x884C;&#x4E3A;&#x7684;&#x5F71;&#x54CD;</strong>&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x548C;&#x5B9E;&#x8DF5;&#x4E0A;&#x90FD;&#x6709;&#x5145;&#x5206;&#x8BBA;&#x8BC1;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x70B9;&#x5BF9;&#x4E8E;Unit-e&#x6765;&#x8BF4;&#x662F;&#x5207;&#x5B9E;&#x53EF;&#x884C;&#x7684;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="_7_3_2_2_user_selected_fees_decoupled_rewards">7.3.2.2 User-selected fees, decoupled rewards&#xFF08;&#x7528;&#x6237;&#x9009;&#x62E9;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x5956;&#x52B1;&#x5206;&#x79BB;&#xFF09;</h4>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Many of the problems from Section 7.3.1 arise because miners can substantially alter their transaction fee rewards by changing which transactions they include in each block. One way to address this problem is by decoupling the transaction fees in a given block from the reward collected by the block miner. If miners cannot significantly alter their rewards by optimizing the transactions in blocks, they are less incentivized to prioritize certain transactions over others.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x7B2C;7.3.1&#x8282;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x4EA7;&#x751F;&#x4E8E;&#x56E0;&#x4E3A;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x8981;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x4EA4;&#x6613;&#x6765;&#x672C;&#x8D28;&#x4E0A;&#x6539;&#x53D8;&#x5176;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5956;&#x52B1;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x7ED9;&#x5B9A;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E0E;&#x6316;&#x51FA;&#x5757;&#x7684;&#x77FF;&#x5DE5;&#x6536;&#x53D6;&#x7684;&#x5956;&#x52B1;&#x8FDB;&#x884C;&#x5206;&#x79BB;&#x3002;&#x5982;&#x679C;&#x77FF;&#x5DE5;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x4F18;&#x5316;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x6765;&#x663E;&#x8457;&#x6539;&#x53D8;&#x5176;&#x5956;&#x52B1;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x5C31;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x53BB;&#x4F18;&#x5148;&#x5904;&#x7406;&#x67D0;&#x4E9B;&#x4EA4;&#x6613;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This operating point is not widely used in live cryptocurrencies, with the exception of Cardano [100]. Nonetheless, the idea of (partially) decoupling a transaction&#x2019;s fee from the miner of the block containing that transaction has been explored in several works, including inclusive blockchains [113], <a href="https://eprint.iacr.org/2016/916.pdf" target="_blank">Fruitchains</a> [137], and Ouroboros [101]. Many of the papers studying this idea are designed for the PoW setting. The basic idea is that the miner of a block does not necessarily reap all the transaction fees in that block, but shares them with other miners who have also contributed to network security and validation. There are many ways to implement such a directive; one explicit mechanism is proposed in Fruitchains, where transaction fees are split evenly over a sequence of consecutive blocks. A key property that Fruitchains exhibit is fairness, defined below.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x9664;&#x827E;&#x8FBE;&#x5E01;[100]&#x5916;&#xFF0C;&#x6B64;&#x64CD;&#x4F5C;&#x70B9;&#x5728;&#x73B0;&#x5B58;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4E2D;&#x5E76;&#x672A;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x5C06;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x6253;&#x5305;&#x8BE5;&#x4EA4;&#x6613;&#x7684;&#x533A;&#x5757;&#x7684;&#x77FF;&#x5DE5;&#x8FDB;&#x884C;&#x5206;&#x79BB;&#xFF08;&#x90E8;&#x5206;&#x5730;&#xFF09;&#x7684;&#x60F3;&#x6CD5;&#x5DF2;&#x5728;&#x82E5;&#x5E72;&#x5DE5;&#x4F5C;&#x4E2D;&#x5F97;&#x5230;&#x63A2;&#x8BA8;&#xFF0C;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x666E;&#x9002;&#x533A;&#x5757;&#x94FE;[113]&#x3001;&#x6C34;&#x679C;&#x94FE;[137]&#x548C;Ouroboros [101]&#x3002;&#x8BB8;&#x591A;&#x7814;&#x7A76;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x7684;&#x8BBA;&#x6587;&#x90FD;&#x662F;&#x4E3A;PoW&#x8BBE;&#x7F6E;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x5C31;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x77FF;&#x5DE5;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x83B7;&#x5F97;&#x8BE5;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x800C;&#x662F;&#x4E0E;&#x5176;&#x4ED6;&#x77FF;&#x5DE5;&#x5171;&#x4EAB;&#x8FD9;&#x4E9B;&#x8D39;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x77FF;&#x5DE5;&#x4E5F;&#x4E3A;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x548C;&#x9A8C;&#x8BC1;&#x505A;&#x51FA;&#x4E86;&#x8D21;&#x732E;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x65B9;&#x9488;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF1B;&#x5728;&#x6C34;&#x679C;&#x94FE;&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x660E;&#x786E;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5373;&#x5728;&#x4E00;&#x7CFB;&#x5217;&#x8FDE;&#x7EED;&#x7684;&#x5757;&#x4E0A;&#x5747;&#x5300;&#x5730;&#x5212;&#x5206;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x6C34;&#x679C;&#x94FE;&#x5C55;&#x793A;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7279;&#x6027;&#x5C31;&#x662F;&#x516C;&#x5E73;&#xFF0C;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Definition 7.3.1 ([137]).</strong> \(\quad\) Consider a Byzantine adversary that controls at most fraction \(&#x3B2;\) of compute power (stake); the remaining compute power (stake) is controlled by an honest party. A blockchain protocol is \(&#x3B4;\)-approximately fair if there exists a time duration \(T_0\) such that for all \(T \geq T_{0}\), in the view of each honest player, the honest party is guaranteed to obtain at least fraction \((1&#x2212;&#x3B4;)(1&#x2212;&#x3B2;)\) of blocks with overwhelming probability in every time window of duration \(T\).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5B9A;&#x4E49;7.3.1</strong>([137]). \(\quad\) &#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x62DC;&#x5360;&#x5EAD;&#x7684;&#x5BF9;&#x624B;&#xFF0C;&#x4ED6;&#x6700;&#x591A;&#x80FD;&#x63A7;&#x5236;&#x7684;&#x7B97;&#x529B;&#xFF08;&#x6743;&#x76CA;&#xFF09;&#x6BD4;&#x4F8B;&#x4E3A; \(&#x3B2;\)&#xFF1B;&#x5269;&#x4E0B;&#x7684;&#x7B97;&#x529B;&#xFF08;&#x6743;&#x76CA;&#xFF09;&#x7531;&#x4E00;&#x4E2A;&#x8BDA;&#x5B9E;&#x6D3E;&#x63A7;&#x5236;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6301;&#x7EED;&#x671F; \(T_0\) &#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x7684; \(T \geq T_{0}\)&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x8BDA;&#x5B9E;&#x53C2;&#x4E0E;&#x8005;&#x770B;&#x6765;&#xFF0C;&#x8BDA;&#x5B9E;&#x6D3E;&#x4FDD;&#x8BC1;&#x5728;&#x6301;&#x7EED;&#x671F; \(T\) &#x5185;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#x90FD;&#x5177;&#x6709;&#x538B;&#x5012;&#x6027;&#x7684;&#x6982;&#x7387;&#x83B7;&#x5F97;&#x81F3;&#x5C11; \((1&#x2212;&#x3B4;)(1&#x2212;&#x3B2;)\) &#x6BD4;&#x4F8B;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x533A;&#x5757;&#x94FE;&#x534F;&#x8BAE;&#x662F;&#x63A5;&#x8FD1; \(&#x3B4;\) &#x516C;&#x5E73;&#x7684;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Fairness is closely related to our notion of equitability from Section 7.2.3. A key difference is that equitability only makes sense for random processes with fixed mean over time (i.e., processes that are stationary up to order 1), whereas fairness encompasses general non-stationary stochastic processes.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x516C;&#x5E73;&#x6027;&#x4E0E;&#x6211;&#x4EEC;&#x5728;&#x7B2C;7.2.3&#x8282;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x5747;&#x8861;&#x6027;&#x6982;&#x5FF5;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF0C;&#x5747;&#x8861;&#x6027;&#x53EA;&#x5BF9;&#x5E73;&#x5747;&#x6570;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x56FA;&#x5B9A;&#x7684;&#x968F;&#x673A;&#x8FC7;&#x7A0B;&#xFF08;&#x5373;&#x8FBE;&#x5230;1&#x9636;&#x7684;&#x5E73;&#x7A33;&#x8FC7;&#x7A0B;&#xFF09;&#x7684;&#x624D;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x800C;&#x516C;&#x5E73;&#x6027;&#x5219;&#x5305;&#x62EC;&#x4E86;&#x4E00;&#x822C;&#x7684;&#x975E;&#x5E73;&#x7A33;&#x968F;&#x673A;&#x8FC7;&#x7A0B;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Fruitchains proposes a mechanism where by instead of directly including transactions in blocks, miners mine a &#x201C;fruit&#x201D; for each transaction [137]. When a transaction first appears in the system, miners start solving a proof-of-work puzzle specific to that transaction, with a different hardness parameter from the main blockchain. This proof-of-work puzzle must include a pointer to a recent block within the previous \(T(&#x3BA;)\) blocks, where &#x3BA; is a security parameter, and \(T(&#x3BA;)\) is a (pre-specified) polynomial function of the security parameter. A solution to this puzzle, concatenated with the puzzle itself, is called a fruit, and gets broadcast to the network. Regular block miners include fruits in their blocks, rather than plaintext transactions. Fruitchains satisfy the following key property:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x6C34;&#x679C;&#x94FE;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x77FF;&#x5DE5;&#x4E0D;&#x518D;&#x5C06;&#x4EA4;&#x6613;&#x76F4;&#x63A5;&#x5305;&#x542B;&#x5728;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x4E2D;&#x53BB;&#x5F00;&#x91C7;&#x201C;fruit&#x201D;[137]&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x9996;&#x6B21;&#x51FA;&#x73B0;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x65F6;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x5F00;&#x59CB;&#x53BB;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x4E8E;&#x8BE5;&#x4EA4;&#x6613;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x96BE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x96BE;&#x5EA6;&#x53C2;&#x6570;&#x4E0E;&#x4E3B;&#x94FE;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x96BE;&#x9898;&#x5FC5;&#x987B;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5148;&#x524D;&#x7684; \(T(k)\) &#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x6700;&#x8FD1;&#x4E00;&#x4E2A;&#x5757;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x5176;&#x4E2D;k&#x662F;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x53C2;&#x6570;&#xFF0C;\(T(k)\) &#x662F;&#x5173;&#x4E8E;&#x5B89;&#x5168;&#x53C2;&#x6570;&#x7684;&#xFF08;&#x9884;&#x5148;&#x6307;&#x5B9A;&#x7684;&#xFF09;&#x591A;&#x9879;&#x5F0F;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4E2A;&#x96BE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4E0E;&#x96BE;&#x9898;&#x672C;&#x8EAB;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6C34;&#x679C;&#xFF08;fruit&#xFF09;&#x201D;&#xFF0C;&#x5E76;&#x88AB;&#x5E7F;&#x64AD;&#x5230;&#x7F51;&#x7EDC;&#x3002;&#x5E38;&#x89C4;&#x7684;&#x533A;&#x5757;&#x77FF;&#x5DE5;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x6C34;&#x679C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EAF;&#x6587;&#x672C;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x6C34;&#x679C;&#x94FE;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x5173;&#x952E;&#x5C5E;&#x6027;&#xFF1A;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Theorem 6 (Fairness, [137]).</strong> \(\quad\) For any constant \(0&lt;\delta&lt;1\), there exists a constant \(\mathrm{T}_{0} = \Theta \left(\frac {1} {\delta} \right)\) such that the Fruitchains protocol is \(\delta\)-approximately fair with respect to an adversary that controls at most \(&#x3B2;\) fraction of the computational power.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x5B9A;&#x7406;6&#xFF08;&#x516C;&#x5E73;&#x6027;&#xFF0C;[137]&#xFF09;</strong> \(\quad\) &#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x5E38;&#x6570; \(0&lt;\delta&lt;1\)&#xFF0C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5E38;&#x6570; \(\mathrm{T}_{0} = \Theta \left(\frac {1} {\delta} \right)\)&#xFF0C;&#x6EE1;&#x8DB3;&#x6C34;&#x679C;&#x94FE;&#x534F;&#x8BAE;&#x5BF9;&#x4E8E;&#x5728;&#x5BF9;&#x624B;&#x6700;&#x591A;&#x63A7;&#x5236;&#x3B2;&#x6BD4;&#x4F8B;&#x7684;&#x7B97;&#x529B;&#x65F6;&#x662F;&#x63A5;&#x8FD1; \(\delta\) &#x516C;&#x5E73;&#x7684;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Notice that fairness holds even without considering incentive mechanisms. To obtain incentive-compatibility, Fruitchains makes a key design decision, which is to distribute rewards (block rewards and transaction fees) evenly to the \(T(k)\) block miners preceding each block. Suppose that within any stretch of \(T(k)\) transactions, the total reward from transaction fees and block rewards is \(V\). We say that honest mining is a \(\beta^{*}\)-coalition-safe \(\gamma\)-Nash equilibrium if, with overwhelming probability, no coalition of \(\beta&lt;\beta^{*}\) can gain more than a multiplicative factor \((1 + \gamma)\) utility, regardless of the transactions being processed. Under this reward allocation scheme, Fruitchains satisfies the following property:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5373;&#x4F7F;&#x4E0D;&#x8003;&#x8651;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#xFF0C;&#x516C;&#x5E73;&#x4E5F;&#x662F;&#x6210;&#x7ACB;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x6FC0;&#x52B1;&#x76F8;&#x5BB9;&#x6027;&#xFF0C;&#x6C34;&#x679C;&#x94FE;&#x505A;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#xFF0C;&#x5373;&#x628A;&#x5956;&#x52B1;&#xFF08;&#x533A;&#x5757;&#x5956;&#x52B1;&#x548C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF09;&#x5E73;&#x5747;&#x5206;&#x914D;&#x7ED9;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E4B;&#x524D;&#x7684;&#x533A;&#x5757; \(T(k)\) &#x7684;&#x77FF;&#x5DE5;&#x3002;&#x5047;&#x8BBE;&#x5728; \(T(k)\) &#x4E2A;&#x4EA4;&#x6613;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5EF6;&#x4F38;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x533A;&#x5757;&#x5956;&#x52B1;&#x5408;&#x8D77;&#x6765;&#x7684;&#x603B;&#x56DE;&#x62A5;&#x4E3A; \(V\)&#x3002;&#x4E0D;&#x8003;&#x8651;&#x6B63;&#x5728;&#x5904;&#x7406;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5B58;&#x5728;&#x5C0F;&#x4E8E; \(\beta^{*}\) &#x7684;&#x8054;&#x76DF; \(\beta\) &#x80FD;&#x591F;&#x4EE5;&#x538B;&#x5012;&#x6027;&#x7684;&#x6982;&#x7387;&#x83B7;&#x5F97;&#x8D85;&#x8FC7;&#x4E00;&#x4E2A;&#x4E58;&#x6CD5;&#x56E0;&#x5B50; (1 + &#x3B3;) &#x7684;&#x6548;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8BDA;&#x5B9E;&#x6316;&#x77FF;&#x662F;&#x4E00;&#x4E2A; \(\beta^{*}\) &#x8054;&#x76DF;&#x5B89;&#x5168;&#x7684; \(\gamma\) &#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x3002;&#x6839;&#x636E;&#x8BE5;&#x5956;&#x52B1;&#x5206;&#x914D;&#x65B9;&#x6848;&#xFF0C;&#x6C34;&#x679C;&#x94FE;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x7279;&#x6027;&#xFF1A;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p><strong>Remark 7.3.2 ([137]).</strong> \(\quad\) Consider a blockchain protocol that satisfies \(&#x3B4;\)-approximate fairness with respect to \(&#x3B2;\) attackers. If rewards are allocated to the \(T(k)\) block miners preceding each block (including the block itself), honest behavior is a \(&#x3B2;\)-coalition-safe, \(3&#x3B4;\)-Nash equilibrium.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p><strong>&#x8BBA;&#x8FF0; 7.3.2 ([137])</strong> \(\quad\) &#x8003;&#x8651;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x534F;&#x8BAE;&#x8981;&#x6EE1;&#x8DB3;&#x5728;&#x62E5;&#x6709; \(&#x3B2;\) &#x653B;&#x51FB;&#x8005;&#x65F6;&#x63A5;&#x8FD1; \(&#x3B4;\) &#x516C;&#x5E73;&#x3002;&#x5982;&#x679C;&#x5956;&#x52B1;&#x5728;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E4B;&#x524D;&#xFF08;&#x5305;&#x62EC;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x672C;&#x8EAB;&#xFF09;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x533A;&#x5757; \(T(k)\) &#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x8BDA;&#x5B9E;&#x884C;&#x4E3A;&#x5C31;&#x662F;&#x4E00;&#x4E2A; \(&#x3B2;\) &#x8054;&#x76DF;&#x5B89;&#x5168;&#x7684;&#x3001;\(3&#x3B4;\) &#x7EB3;&#x4EC0;&#x5747;&#x8861;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>This remark is straightforward to derive. Fairness implies that within each stretch of \(T(&#x3BA;)\) blocks, the fraction of adversarial blocks is upper bounded by \(\beta (1 + \delta)\), so the adversary&#x2019;s reward is upper bounded by \(\beta (1 + \delta) V\). By fairness, if the adversary had followed the honest protocol, it would be guaranteed to reap a reward of at least \((1 - \delta) \beta V\). Hence the adversary gains a factor of at most</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\frac {(1 + \delta)} {(1 - \delta)} \leq 1 + 3\delta
\end{equation}</p>
</div>
<div class="paragraph">
<p>in rewards for \(\delta&lt;\frac{1}{3}\). Notice that this result depends on two key components: &#xFB01;rst, the underlying blockchain protocol should be fair. Second, the reward allocation scheme should split rewards evenly among miners. By adopting a version of Fruitchains adapted to PoS (e.g., as proposed in Snow White [52] or Ouroboros [101]), we can obtain analogous results.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x4E2A;&#x8BBA;&#x8FF0;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x51FA;&#x3002;&#x516C;&#x5E73;&#x610F;&#x5473;&#x7740;&#x5728; \(T(&#x3BA;)\) &#x4E2A;&#x533A;&#x5757;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5EF6;&#x4F38;&#x4E4B;&#x5185;&#xFF0C;&#x654C;&#x5BF9;&#x533A;&#x5757;&#x7684;&#x6BD4;&#x4F8B;&#x4E0A;&#x9650;&#x662F; \(\beta (1 + \delta)\)&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x624B;&#x7684;&#x5956;&#x52B1;&#x4E0A;&#x9650;&#x662F; \(\beta (1 + \delta) V\) &#x3002;&#x516C;&#x5E73;&#x5730;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x624B;&#x9075;&#x5FAA;&#x8BDA;&#x5B9E;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5C06;&#x4FDD;&#x8BC1;&#x4F1A;&#x83B7;&#x5F97;&#x81F3;&#x5C11; \((1 - \delta) \beta V\) &#x7684;&#x5956;&#x52B1;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x624B;&#x6700;&#x591A;&#x53EF;&#x83B7;&#x5F97;&#x7684;&#x5956;&#x52B1;&#x4E0E;&#x4EE5;&#x4E0B;&#x4E58;&#x6570;&#x56E0;&#x5B50;&#x76F8;&#x5173;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>\begin{equation}
\frac {(1 + \delta)} {(1 - \delta)} \leq 1 + 3\delta
\end{equation}</p>
</div>
<div class="paragraph">
<p>&#x5176;&#x4E2D; \(\delta&lt;\frac{1}{3}\)&#x3002;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E00;&#x7ED3;&#x679C;&#x53D6;&#x51B3;&#x4E8E;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x5E95;&#x5C42;&#x533A;&#x5757;&#x94FE;&#x534F;&#x8BAE;&#x5E94;&#x8BE5;&#x662F;&#x516C;&#x5E73;&#x7684;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5956;&#x52B1;&#x5206;&#x914D;&#x65B9;&#x6848;&#x5E94;&#x8BE5;&#x5728;&#x77FF;&#x5DE5;&#x4E4B;&#x95F4;&#x5E73;&#x5747;&#x5730;&#x5206;&#x5272;&#x5956;&#x52B1;&#x3002;&#x901A;&#x8FC7;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x4E8E;PoS&#x7684;&#x6C34;&#x679C;&#x94FE;&#x7248;&#x672C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;Snow White [52]&#x6216;Ouroboros [101]&#x4E2D;&#x6240;&#x8FF0;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x7C7B;&#x4F3C;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>There is a key downside to sharing transaction fees across a sequence of block proposers, while also allowing users to propose their own fees. Since miners do not collect all the transaction fees from a block, they are less incentivized to include transactions with higher fees first; this means that users have a much weaker incentive to propose fees above the minimum. A key question that must be answered is whether such a system can raise enough transaction fee revenue to pay for network security. At the moment, there is no research quantifying this question (as far as we know).</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x901A;&#x8FC7;&#x533A;&#x5757;&#x63D0;&#x6848;&#x8005;&#x7684;&#x987A;&#x5E8F;&#x53BB;&#x5747;&#x5206;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x63D0;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x8FD9;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4ECE;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x6536;&#x53D6;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x53BB;&#x4F18;&#x5148;&#x6253;&#x5305;&#x66F4;&#x9AD8;&#x8D39;&#x7528;&#x7684;&#x4EA4;&#x6613;&#xFF1B;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x7528;&#x6237;&#x63D0;&#x51FA;&#x9AD8;&#x4E8E;&#x6700;&#x4F4E;&#x6C34;&#x5E73;&#x7684;&#x8D39;&#x7528;&#x7684;&#x52A8;&#x673A;&#x5C31;&#x8981;&#x5F31;&#x5F97;&#x591A;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x56DE;&#x7B54;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x80FD;&#x591F;&#x7B79;&#x96C6;&#x8DB3;&#x591F;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x6536;&#x5165;&#x6765;&#x4E3A;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4E70;&#x5355;&#x5462;&#xFF1F;&#x76EE;&#x524D;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x7814;&#x7A76;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x91CF;&#x5316;&#xFF08;&#x636E;&#x6211;&#x4EEC;&#x6240;&#x77E5;&#xFF09;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="_7_3_2_3_algorithmic_fees_miner_gets_full_transaction_fees">7.3.2.3 Algorithmic fees, miner gets full transaction fees&#xFF08;&#x57FA;&#x4E8E;&#x7B97;&#x6CD5;&#x6536;&#x8D39;&#xFF0C;&#x77FF;&#x5DE5;&#x83B7;&#x5F97;&#x5168;&#x989D;&#x4EA4;&#x6613;&#x8D39;&#xFF09;</h4>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>A third operating point is that transaction fees could be chosen purely algorithmically, but miners would still reap the full transaction fees of each block they mine. To the best of our knowledge, there are no cryptocurrencies or papers advocating for this approach. Nonetheless, there are related workflows in existing systems. For instance, the Bitcoin Core wallet has a slider that allows the user to choose a desired processing speed; the wallet then algorithmically chooses a fee based on the blockchain&#x2019;s historical processing rates as a function of fees. Since the underlying blockchain is just Bitcoin, the miner that includes said transaction would reap the (algorithmically-chosen) fee.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x64CD;&#x4F5C;&#x70B9;&#x662F;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EAF;&#x7CB9;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x662F;&#x77FF;&#x5DE5;&#x4EEC;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x6316;&#x51FA;&#x7684;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x636E;&#x6211;&#x4EEC;&#x6240;&#x77E5;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x6216;&#x8BBA;&#x6587;&#x5728;&#x63D0;&#x5021;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x5728;&#x73B0;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FD8;&#x662F;&#x6709;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6838;&#x5FC3;&#x94B1;&#x5305;&#x6709;&#x4E00;&#x4E2A;&#x6ED1;&#x52A8;&#x6761;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x9009;&#x62E9;&#x9700;&#x8981;&#x7684;&#x5904;&#x7406;&#x901F;&#x5EA6;&#xFF1B;&#x7136;&#x540E;&#x94B1;&#x5305;&#x6839;&#x636E;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5386;&#x53F2;&#x5904;&#x7406;&#x8D39;&#x7387;&#xFF0C;&#x7B97;&#x6CD5;&#x6027;&#x5730;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8D39;&#x7528;&#x4F5C;&#x4E3A;&#x6536;&#x8D39;&#x51FD;&#x6570;&#x3002;&#x7531;&#x4E8E;&#x5E95;&#x5C42;&#x533A;&#x5757;&#x94FE;&#x5C31;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x6253;&#x5305;&#x4E0A;&#x8FF0;&#x4EA4;&#x6613;&#x7684;&#x77FF;&#x5DE5;&#x5C06;&#x83B7;&#x5F97;&#xFF08;&#x7B97;&#x6CD5;&#x9009;&#x62E9;&#x7684;&#xFF09;&#x8D39;&#x7528;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The previous example belies a key point: our reason for exploring algorithmic fees in the first place is to prevent users from paying higher fees to enable faster transaction processing. This is the key source of congestion, as described in Section 7.3.1. A relevant question, then, is how an algorithm might choose a transaction fee.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x524D;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x8BC1;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#xFF1A;&#x6211;&#x4EEC;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x63A2;&#x8BA8;&#x57FA;&#x4E8E;&#x7B97;&#x6CD5;&#x6536;&#x8D39;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x7528;&#x6237;&#x652F;&#x4ED8;&#x66F4;&#x9AD8;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x66F4;&#x5FEB;&#x7684;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x3002;&#x5982;&#x7B2C;7.3.1&#x8282;&#x6240;&#x8FF0;&#xFF0C;&#x8FD9;&#x662F;&#x62E5;&#x5835;&#x7684;&#x5173;&#x952E;&#x6E90;&#x5934;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2D;&#x80AF;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x7B97;&#x6CD5;&#x5982;&#x4F55;&#x6765;&#x9009;&#x62E9;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5462;&#xFF1F;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Fundamentally, transaction fees pay for two properties: security and convenience. This cost can be broken down into the internal (computational and storage) cost of validating and storing transactions, and the external (communication, security) cost of coming to consensus with the rest of the network. Internal costs are primarily governed by transaction byte size; the larger the transaction, the more resources are required to store the transaction. External costs are more subtle to quantify. At first glance, these costs also seem to scale primarily with transaction byte size, since the consensus protocol does not explicitly differentiate between transactions and byte size determines communication cost. However, in practice, transaction value also plays an important role, for a few reasons.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x8BB2;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E3A;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#x4E70;&#x5355;&#xFF1A;&#x5B89;&#x5168;&#x6027;&#x548C;&#x4FBF;&#x5229;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#x6210;&#x672C;&#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A;&#x9A8C;&#x8BC1;&#x548C;&#x5B58;&#x50A8;&#x4EA4;&#x6613;&#x7684;&#x5185;&#x90E8;&#xFF08;&#x8BA1;&#x7B97;&#x548C;&#x5B58;&#x50A8;&#xFF09;&#x6210;&#x672C;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x7F51;&#x7EDC;&#x5176;&#x4ED6;&#x4EBA;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x7684;&#x5916;&#x90E8;&#xFF08;&#x901A;&#x4FE1;&#x3001;&#x5B89;&#x5168;&#xFF09;&#x6210;&#x672C;&#x3002;&#x5185;&#x90E8;&#x6210;&#x672C;&#x4E3B;&#x8981;&#x7531;&#x4EA4;&#x6613;&#x5C3A;&#x5BF8;&#x7684;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x51B3;&#x5B9A;&#xFF1B;&#x4EA4;&#x6613;&#x5C3A;&#x5BF8;&#x8D8A;&#x5927;&#xFF0C;&#x5B58;&#x50A8;&#x4EA4;&#x6613;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x5C31;&#x8D8A;&#x591A;&#x3002;&#x5916;&#x90E8;&#x6210;&#x672C;&#x8981;&#x91CF;&#x5316;&#x8D77;&#x6765;&#x5C31;&#x66F4;&#x52A0;&#x5FAE;&#x5999;&#x4E86;&#x3002;&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#x4F3C;&#x4E4E;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x4EA4;&#x6613;&#x7684;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x6765;&#x8861;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x5171;&#x8BC6;&#x534F;&#x8BAE;&#x5E76;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x533A;&#x5206;&#x4EA4;&#x6613;&#x548C;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x51B3;&#x5B9A;&#x7684;&#x901A;&#x4FE1;&#x6210;&#x672C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#x4E5F;&#x8D77;&#x7740;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x6709;&#x8FD9;&#x4E48;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="olist arabic">
<ol class="arabic">
<li>
<p><strong>Processing cost.</strong> \(\quad\) High-value transactions require better security; they are more appealing targets, and therefore bear a higher standard for validation and finalization. Since it is common practice to wait longer before considering a high-value transaction as confirmed, the network implicitly expends more effort to confirm high-value transactions.4</p>
</li>
<li>
<p><strong>Security.</strong> \(\quad\) Taking a more global view, transaction fees in aggregate fund the security of the network as a whole. Since higher-value payments increase the need for security, they should also bear a larger burden in terms of paying for that increased security. User-proposed fees do not satisfy this requirement, because they are only tied to transaction value through the user&#x2019;s preferences.</p>
</li>
<li>
<p><strong>Economic fairness.</strong> \(\quad\) Finally, existing payment networks (e.g., credit cards) typically set fees as a fixed percentage of transaction value. If Unit-e&#x2019;s fees are lower than those of traditional payment systems, then it is capturing a surplus for users. In order to distribute that surplus fairly among users, transaction fees should similarly be set as a percentage of transaction value.</p>
</li>
</ol>
</div>
</blockquote>
</div>
<div class="ulist">
<ul>
<li>
<p>1.<strong>&#x5904;&#x7406;&#x6210;&#x672C;</strong> \(\quad\) &#x9AD8;&#x4EF7;&#x503C;&#x7684;&#x4EA4;&#x6613;&#x9700;&#x8981;&#x66F4;&#x597D;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF1B;&#x5B83;&#x4EEC;&#x662F;&#x66F4;&#x5177;&#x5438;&#x5F15;&#x529B;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x627F;&#x62C5;&#x66F4;&#x9AD8;&#x6807;&#x51C6;&#x7684;&#x9A8C;&#x8BC1;&#x548C;&#x5B9A;&#x7A3F;&#x3002;&#x7531;&#x4E8E;&#x5728;&#x5C06;&#x9AD8;&#x4EF7;&#x503C;&#x4EA4;&#x6613;&#x89C6;&#x4E3A;&#x5DF2;&#x786E;&#x8BA4;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x66F4;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x5E38;&#x89C1;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x7F51;&#x7EDC;&#x4F1A;&#x9690;&#x6027;&#x5730;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x7CBE;&#x529B;&#x6765;&#x786E;&#x8BA4;&#x9AD8;&#x4EF7;&#x503C;&#x4EA4;&#x6613;&#x3002;</p>
</li>
<li>
<p>2.<strong>&#x5B89;&#x5168;&#x6027;</strong> \(\quad\) &#x4ECE;&#x66F4;&#x5168;&#x5C40;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5F52;&#x7ED3;&#x8D77;&#x6765;&#x4E3A;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x5B89;&#x5168;&#x63D0;&#x4F9B;&#x4E86;&#x8D44;&#x91D1;&#x3002;&#x7531;&#x4E8E;&#x66F4;&#x9AD8;&#x4EF7;&#x503C;&#x7684;&#x652F;&#x4ED8;&#x589E;&#x52A0;&#x4E86;&#x5BF9;&#x5B89;&#x5168;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5C31;&#x63D0;&#x9AD8;&#x5B89;&#x5168;&#x6027;&#x6240;&#x4F5C;&#x7684;&#x652F;&#x4ED8;&#x800C;&#x8A00;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x5E94;&#x8BE5;&#x627F;&#x62C5;&#x66F4;&#x5927;&#x7684;&#x8D23;&#x4EFB;&#x3002;&#x7528;&#x6237;&#x81EA;&#x4E3B;&#x63D0;&#x8BAE;&#x7684;&#x6536;&#x8D39;&#x6EE1;&#x8DB3;&#x4E0D;&#x4E86;&#x8FD9;&#x4E00;&#x8981;&#x6C42;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4EC5;&#x4EC5;&#x662F;&#x901A;&#x8FC7;&#x7528;&#x6237;&#x7684;&#x53C2;&#x6570;&#x9009;&#x62E9;&#x4E0E;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#x6302;&#x94A9;&#x7684;&#x3002;</p>
</li>
<li>
<p>3. <strong>&#x7ECF;&#x6D4E;&#x516C;&#x5E73;</strong> \(\quad\) &#x6700;&#x7EC8;&#xFF0C;&#x73B0;&#x6709;&#x7684;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#xFF08;&#x5982;&#x4FE1;&#x7528;&#x5361;&#xFF09;&#x901A;&#x5E38;&#x662F;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x548C;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#x56FA;&#x5B9A;&#x767E;&#x5206;&#x6BD4;&#x7684;&#x8D39;&#x7528;&#x3002;&#x5982;&#x679C;Unit-E&#x7684;&#x8D39;&#x7528;&#x4F4E;&#x4E8E;&#x4F20;&#x7EDF;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x4E3A;&#x7528;&#x6237;&#x593A;&#x5F97;&#x76C8;&#x4F59;&#x3002;&#x4E3A;&#x4E86;&#x5728;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x516C;&#x5E73;&#x5730;&#x5206;&#x914D;&#x90A3;&#x4E9B;&#x76C8;&#x4F59;&#x5229;&#x76CA;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x7C7B;&#x4F3C;&#x5730;&#x6309;&#x7167;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#x7684;&#x767E;&#x5206;&#x6BD4;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x8BBE;&#x7F6E;&#x3002;</p>
</li>
</ul>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>These arguments collectively suggest that transaction fees should somehow scale with transaction value (not necessarily linearly). We therefore consider a fee mechanism that is programmatically determined. For each transaction, wallet software will evaluate a function \(w(&#xB7;)\) that takes as inputs a number of features, including transaction value \(v\), transaction byte size \(b\), and possibly other parameters capturing the current level of network health \(h\). Including network health in the computation enables adaptive fees that respond to network conditions, such as congestion and/or gaps in security. Although we have not specified yet how w should be defined, it should satisfy a few basic properties:</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8FD9;&#x4E9B;&#x8BBA;&#x70B9;&#x5171;&#x540C;&#x8868;&#x660E;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5E94;&#x8BE5;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x4E0E;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#xFF08;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF09;&#x6210;&#x6BD4;&#x4F8B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x7531;&#x7A0B;&#x5E8F;&#x51B3;&#x5B9A;&#x7684;&#x6536;&#x8D39;&#x673A;&#x5236;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#x5C06;&#x4F30;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x51FD;&#x6570; \(w(&#xB7;)\)&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x53EF;&#x89C6;&#x4E3A;&#x5728;&#x8F93;&#x5165;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x5305;&#x62EC;&#x4EA4;&#x6613;&#x4EF7;&#x503C; \(v\)&#x3001;&#x4EA4;&#x6613;&#x5B57;&#x8282;&#x5927;&#x5C0F; \(b\)&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x6355;&#x83B7;&#x5F53;&#x524D;&#x7F51;&#x7EDC;&#x5065;&#x5EB7;&#x6C34;&#x5E73; \(h\) &#x7684;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x5373;&#x6536;&#x8D39;&#x548C; \(v&#x3001;b&#x3001;h\) &#x6302;&#x94A9;&#xFF09;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x4E2D;&#x5305;&#x542B;&#x7F51;&#x7EDC;&#x5065;&#x5EB7;&#x72B6;&#x51B5;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x54CD;&#x5E94;&#x7F51;&#x7EDC;&#x72B6;&#x51B5;&#x7684;&#x81EA;&#x9002;&#x5E94;&#x8D39;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x62E5;&#x5835;&#x548C;/&#x6216;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x5B9A;&#x4E49; w&#xFF0C;&#x4F46;&#x5B83;&#x5E94;&#x8BE5;&#x6EE1;&#x8DB3;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7279;&#x6027;&#xFF1A;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="ulist">
<ul>
<li>
<p><strong>Boundedness:</strong> For all \(v, b, h \geq 0\),</p>
</li>
</ul>
</div>
</blockquote>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>&#x6709;&#x754C;&#x6027;&#xFF1A;</strong>&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684; \(v, b, h \geq 0\)&#xFF0C;&#x6709;&#xFF1A;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>\begin{equation}
\underline{w} \leq w(v, b, h) \leq \overline{w} v
\end{equation}</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>where \(\underline{w}\) is a hard-coded lower bound on the transaction fee, chosen to make spamming attacks costly. Similarly, \(\overline{w}\) is an upper bound on the fee rate, or the amount of fees per unit transaction value. We expect to choose \(\overline{w}\) based on merchant feedback.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x5373;&#x6536;&#x8D39;&#x6709;&#x4E0A;&#x4E0B;&#x8FB9;&#x754C;&#x3002;&#x5176;&#x4E2D; \(\underline{w}\) &#x662F;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x786C;&#x7F16;&#x7801;&#x4E0B;&#x9650;&#xFF0C;&#x9009;&#x6765;&#x4F5C;&#x4E3A;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x653B;&#x51FB;&#x7684;&#x6210;&#x672C;&#x3002;&#x540C;&#x6837;&#xFF0C;\(\overline{w}\) &#x662F;&#x6536;&#x8D39;&#x8D39;&#x7387;&#x7684;&#x4E0A;&#x9650;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5355;&#x4F4D;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#x7684;&#x8D39;&#x7528;&#x91D1;&#x989D;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6839;&#x636E;&#x5546;&#x5BB6;&#x53CD;&#x9988;&#x9009;&#x62E9; \(\overline{w}\)&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="ulist">
<ul>
<li>
<p><strong>Monotonicity</strong> (transaction value): For any \(v_{1} &lt; v_{2}, b, \text { and } h\),</p>
</li>
</ul>
</div>
</blockquote>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>&#x5355;&#x8C03;&#x6027;&#xFF08;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#xFF09;</strong>&#xFF1A;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7684; \(v_{1}&#x3001; v_{2}&#x3001;b&#x3001;h\)&#xFF0C;&#x5176;&#x4E2D;\(v_{1} &lt; v_{2}\)&#xFF0C;&#x6709;&#xFF1A;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>\begin{equation}
w\left(v_{1}, b, h\right) \leq w\left(v_{2}, b, h\right)
\end{equation}</p>
</div>
<div class="paragraph">
<p>&#x5373;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#x4F4E;&#x7684;&#x6536;&#x8D39;&#x4F4E;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="ulist">
<ul>
<li>
<p><strong>Monotonicity</strong> (transaction byte size): For any \(b_{1}&lt;b_{2}, v, \text { and } h\),</p>
</li>
</ul>
</div>
</blockquote>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>&#x5355;&#x8C03;&#x6027;</strong>&#xFF08;&#x4EA4;&#x6613;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#xFF09;&#xFF1A;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7684; \(b_{1}&#x3001;b_{2}&#x3001;v&#x3001;h\)&#xFF0C;&#x5176;&#x4E2D; \(b_{1}&lt;b_{2}\)&#xFF0C;&#x6709;&#xFF1A;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>\begin{equation}
w \left(v, b_{1}, h\right) \leq w \left(v, b_{2}, h\right)
\end{equation}</p>
</div>
<div class="paragraph">
<p>&#x5373;&#x4EA4;&#x6613;&#x5B57;&#x8282;&#x8D8A;&#x5927;&#xFF0C;&#x6536;&#x8D39;&#x8D8A;&#x9AD8;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Many functions satisfy these broad requirements, with different tradeoffs. Consider the operating point where miners reap the full transaction fees of each block they mine; intuitively, for a given function w, the weaker its dependency on transaction value, the less congestion we expect to see. This is because of the arguments in Section 7.3.1; congestion is caused by miners choosing which transactions appear in each block. At the same time, weakening this dependency degrades the system&#x2019;s security properties. A key research question is to analyze the effects of different transaction fee functions on the congestion-security tradeoff.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x8BB8;&#x591A;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x6743;&#x8861;&#x6765;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E9B;&#x5E7F;&#x6CDB;&#x7684;&#x9700;&#x6C42;&#x3002;&#x8003;&#x8651;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x70B9;&#xFF0C;&#x77FF;&#x5DE5;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x6316;&#x5230;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF1B;&#x76F4;&#x89C2;&#x5730;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x51FD;&#x6570; \(w\)&#xFF0C;&#x5B83;&#x5BF9;&#x4EA4;&#x6613;&#x4EF7;&#x503C;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x8D8A;&#x5F31;&#xFF0C;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x770B;&#x5230;&#x7684;&#x62E5;&#x5835;&#x5C31;&#x8D8A;&#x5C11;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x7B2C; 7.3.1 &#x8282;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#x8BF4;&#x5230;&#xFF0C;&#x62E5;&#x5835;&#x662F;&#x7531;&#x4E8E;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x81EA;&#x4E3B;&#x9009;&#x62E9;&#x5728;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x4EA4;&#x6613;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x524A;&#x5F31;&#x8FD9;&#x79CD;&#x4F9D;&#x8D56;&#x6027;&#x4F1A;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x5C5E;&#x6027;&#x3002;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x7814;&#x7A76;&#x8BAE;&#x9898;&#x5C31;&#x662F;&#x5206;&#x6790;&#x4E0D;&#x540C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x62E5;&#x5835;&#x4E0E;&#x5B89;&#x5168;&#x4E4B;&#x95F4;&#x7684;&#x6743;&#x8861;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>In summary, the approach of choosing transaction fees purely algorithmically has some attractive properties; primarily, transaction fee rates would no longer be unbounded. However, the core problem of congestion remains. High-fee transactions will still be processed earlier, which promotes a hierarchy among transactions, and raises questions of fairness to users.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x603B;&#x4E4B;&#xFF0C;&#x7EAF;&#x7CB9;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x9009;&#x62E9;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x62E5;&#x6709;&#x4E00;&#x4E9B;&#x5F15;&#x4EBA;&#x6CE8;&#x76EE;&#x7684;&#x7279;&#x6027;&#xFF1B;&#x9996;&#x5F53;&#x5176;&#x51B2;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7387;&#x4E0D;&#x518D;&#x662F;&#x6CA1;&#x6709;&#x8FB9;&#x754C;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x62E5;&#x5835;&#x7684;&#x6838;&#x5FC3;&#x95EE;&#x9898;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x3002;&#x9AD8;&#x6536;&#x8D39;&#x7684;&#x4EA4;&#x6613;&#x4ECD;&#x7136;&#x4F1A;&#x88AB;&#x4F18;&#x5148;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4FC3;&#x4F7F;&#x4EA4;&#x6613;&#x4E0E;&#x4EA4;&#x6613;&#x4E4B;&#x95F4;&#x6709;&#x4E86;&#x5C42;&#x6B21;&#x7B49;&#x7EA7;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x516C;&#x5E73;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="_7_3_2_4_algorithmic_fees_decoupled_rewards">7.3.2.4 Algorithmic fees, decoupled rewards.&#xFF08;&#x57FA;&#x4E8E;&#x7B97;&#x6CD5;&#x6536;&#x8D39;&#xFF0C;&#x5956;&#x52B1;&#x5206;&#x79BB;&#xFF09;</h4>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>The fourth operating point consists of choosing fees purely algorithmically, while also partially decoupling the allocation of transaction fees from the block(s) that included those transactions. This is the least well-understood among the four operating points, but it has some appealing properties. First, transaction fees can be bounded. Second, congestion can be reduced, by reducing the incentive for miners to strongly favor transactions with high fees. Third, unlike the operating point in Section 7.3.2.2 (user-selected fees, decoupled rewards), it does not matter that users are not incentivized to propose higher fees, since we can algorithmically choose fees that support network functionality. A key downside of this approach is complexity; analyzing the incentives of miners and the relation between the fee structure and network viability may be quite complicated if the transaction fee algorithm is complex. We view this as the main obstacle to this approach, and an important direction for future research and consideration in the transaction fee design of Unit-e.</p>
</div>
</blockquote>
</div>
<div class="paragraph">
<p>&#x7B2C;&#x56DB;&#x4E2A;&#x64CD;&#x4F5C;&#x70B9;&#x5305;&#x62EC;&#x7EAF;&#x7B97;&#x6CD5;&#x5730;&#x9009;&#x62E9;&#x8D39;&#x7528;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x90E8;&#x5206;&#x5730;&#x5C06;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x5206;&#x914D;&#x4E0E;&#x5305;&#x542B;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x7684;&#x533A;&#x5757;&#x5206;&#x79BB;&#x3002;&#x8FD9;&#x662F;&#x56DB;&#x4E2A;&#x64CD;&#x4F5C;&#x70B9;&#x4E2D;&#x6700;&#x4E0D;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x6709;&#x4E00;&#x4E9B;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x7279;&#x6027;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x662F;&#x6709;&#x8FB9;&#x754C;&#x7684;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x901A;&#x8FC7;&#x524A;&#x5F31;&#x77FF;&#x5DE5;&#x504F;&#x7231;&#x9AD8;&#x6536;&#x8D39;&#x4EA4;&#x6613;&#x7684;&#x6FC0;&#x52B1;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x62E5;&#x5835;&#x3002;&#x518D;&#x8005;&#xFF0C;&#x4E0E;&#x7B2C;7.3.2.2&#x8282;&#xFF08;&#x7528;&#x6237;&#x81EA;&#x9009;&#x8D39;&#x7528;&#x3001;&#x5956;&#x52B1;&#x5206;&#x79BB;&#xFF09;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x70B9;&#x4E0D;&#x540C;&#xFF0C;&#x4E0D;&#x9F13;&#x52B1;&#x7528;&#x6237;&#x63D0;&#x51FA;&#x66F4;&#x9AD8;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x7B97;&#x6CD5;&#x4E0A;&#x9009;&#x62E9;&#x652F;&#x6301;&#x7F51;&#x7EDC;&#x529F;&#x80FD;&#x7684;&#x8D39;&#x7528;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x590D;&#x6742;&#x6027;&#xFF1B;&#x5982;&#x679C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7B97;&#x6CD5;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x5206;&#x6790;&#x77FF;&#x5DE5;&#x7684;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x4EE5;&#x53CA;&#x8D39;&#x7528;&#x7ED3;&#x6784;&#x4E0E;&#x7F51;&#x7EDC;&#x751F;&#x5B58;&#x80FD;&#x529B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x590D;&#x6742;&#x3002;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x672C;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x8981;&#x969C;&#x788D;&#xFF0C;&#x4F46;&#x4E5F;&#x662F;&#x672A;&#x6765;&#x7814;&#x7A76;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x65B9;&#x5411;&#xFF0C;&#x540C;&#x6837;&#x662F;&#x5728;&#x8BBE;&#x8BA1;Unit-e&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x65F6;&#x8003;&#x8651;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x65B9;&#x5411;&#x3002;</p>
</div>
</div>
</div>
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="CH02_Block_Rewards.html" class="navigation navigation-prev " aria-label="Previous page: Block Rewards">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CH04_Acknowledgement.html" class="navigation navigation-next " aria-label="Next page: Acknowledgement">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Transaction Fees","level":"1.2.5","depth":2,"next":{"title":"Acknowledgement","level":"1.2.6","depth":2,"path":"Decentralized_Payment_Systems_Economics/CH04_Acknowledgement.asciidoc","ref":"Decentralized_Payment_Systems_Economics/CH04_Acknowledgement.asciidoc","articles":[]},"previous":{"title":"Block Rewards","level":"1.2.4","depth":2,"path":"Decentralized_Payment_Systems_Economics/CH02_Block_Rewards.asciidoc","ref":"Decentralized_Payment_Systems_Economics/CH02_Block_Rewards.asciidoc","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-livereload","search-plus","include-codeblock","ace","splitter","mathjax","emphasize","expandable-chapters","sectionx","back-to-top-button","chapter-fold","todo","terminal","alerts","simple-page-toc"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"chapter-fold":{},"emphasize":{},"ace":{},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"todo":{},"splitter":{},"fontsettings":{"theme":"white","family":"sans","size":2},"sectionx":{"tag":"b"},"highlight":{},"back-to-top-button":{},"alerts":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"include-codeblock":{"check":false,"edit":true,"fixlang":false,"lang":"","template":"ace","theme":"chrome","unindent":true},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"terminal":{"copyButtons":true,"fade":false,"style":"flat"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{},"search-plus":{}},"theme":"default","author":"听风","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","language":"zh-hans","output.name":"blocklee","links":{"sidebar":{"Home":"https://f-labs.github.io/Cryptoeconomics"},"styles":{"website":"styles/website.css"}},"gitbook":"3.2.3","description":"分布式系统的加密经济学原理与设计"},"file":{"path":"Decentralized_Payment_Systems_Economics/CH03_Transaction_Fees.asciidoc","mtime":"2019-05-05T09:26:02.671Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-05-05T09:27:33.904Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ace/ace/ace.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ace/ace.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-terminal/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

