
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>用货币经济学进行token设计 · Cryptoeconomics</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="听风">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-ace/ace.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-terminal/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="CH05.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://f-labs.github.io/Cryptoeconomics" target="_blank" class="custom-link">Home</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    Decentralized Payment Systems Economics
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../Decentralized_Payment_Systems_Economics/">
            
                <a href="../Decentralized_Payment_Systems_Economics/">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../Decentralized_Payment_Systems_Economics/CH00_Preface.html">
            
                <a href="../Decentralized_Payment_Systems_Economics/CH00_Preface.html">
            
                    
                    Preface
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../Decentralized_Payment_Systems_Economics/CH01_Valuation.html">
            
                <a href="../Decentralized_Payment_Systems_Economics/CH01_Valuation.html">
            
                    
                    Valuation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../Decentralized_Payment_Systems_Economics/CH02_Block_Rewards.html">
            
                <a href="../Decentralized_Payment_Systems_Economics/CH02_Block_Rewards.html">
            
                    
                    Block Rewards
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../Decentralized_Payment_Systems_Economics/CH03_Transaction_Fees.html">
            
                <a href="../Decentralized_Payment_Systems_Economics/CH03_Transaction_Fees.html">
            
                    
                    Transaction Fees
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../Decentralized_Payment_Systems_Economics/CH04_Acknowledgement.html">
            
                <a href="../Decentralized_Payment_Systems_Economics/CH04_Acknowledgement.html">
            
                    
                    Acknowledgement
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    Token Economics Incentive design
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="CH01.html">
            
                <a href="CH01.html">
            
                    
                    加密经济学和Token经济的起源和定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="CH02.html">
            
                <a href="CH02.html">
            
                    
                    机制设计和博弈论基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="CH03.html">
            
                <a href="CH03.html">
            
                    
                    共识机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="CH04.html">
            
                <a href="CH04.html">
            
                    
                    Token分类和Token经济的设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="CH05.html">
            
                <a href="CH05.html">
            
                    
                    Token的供给和需求
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.6" data-path="CH06.html">
            
                <a href="CH06.html">
            
                    
                    用货币经济学进行token设计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >用货币经济学进行token设计</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7528;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x8FDB;&#x884C;token&#x8BBE;&#x8BA1;">&#x7528;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x8FDB;&#x884C;token&#x8BBE;&#x8BA1;</h2>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#xFF1F;</h3>
<p>&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x7814;&#x7A76;&#x4E0D;&#x540C;&#x8D27;&#x5E01;&#x7406;&#x8BBA;&#x7684;&#x7ECF;&#x6D4E;&#x5B66;&#x5206;&#x652F;&#xFF0C;&#x4E13;&#x95E8;&#x7814;&#x7A76;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x7B49;&#x673A;&#x6784;&#xFF0C;&#x5982;&#x4F55;&#x5229;&#x7528;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x91CF;&#x548C;&#x5229;&#x7387;&#x7B49;&#x53D8;&#x91CF;&#xFF0C;&#x6765;&#x5F71;&#x54CD;&#x8D27;&#x5E01;&#x4EF7;&#x683C;&#x548C;&#x7ECF;&#x6D4E;&#x4E2D;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x5728;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x548C;&#x535A;&#x5F08;&#x8BBA;&#x4E2D;&#xFF0C;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x5BB6;&#x5B9E;&#x7528;&#x6FC0;&#x52B1;&#x5DE5;&#x5177;&#x6765;&#x8BBE;&#x8BA1;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6216;&#x964D;&#x4F4E;&#x77ED;&#x671F;&#x5229;&#x7387;&#xFF0C;&#x6765;&#x6FC0;&#x52B1;&#x6216;&#x6291;&#x5236;&#x4EBA;&#x4EEC;&#x501F;&#x94B1;&#x3002;&#x5982;&#x679C;&#x5229;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x7684;&#x5229;&#x606F;&#x5C31;&#x5F88;&#x4F4E;&#xFF0C;&#x8FD9;&#x4F1A;&#x523A;&#x6FC0;&#x501F;&#x8D37;&#xFF0C;&#x5E76;&#x7ED9;&#x4F60;&#x66F4;&#x591A;&#x7684;&#x94B1;&#x6765;&#x6D88;&#x8D39;&#x3002;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x8BB2;&#xFF0C;&#x8FD9;&#x521B;&#x9020;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x6D88;&#x8D39;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x7ECF;&#x6D4E;&#x6D3B;&#x52A8;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4E86;&#xFF0C;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x5BB6;&#x5982;&#x4F55;&#x5229;&#x7528;&#x6FC0;&#x52B1;&#x624B;&#x6BB5;&#xFF0C;&#x6765;&#x8FBE;&#x5230;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6B64;&#x53EA;&#x8BA8;&#x8BBA;&#x4E24;&#x4E2A;&#x5BF9;token&#x8BBE;&#x8BA1;&#x8005;&#x6700;&#x6709;&#x7528;&#x7684;&#x9886;&#x57DF;&#xFF1A;</p>
<ul>
<li><p>&#x8D27;&#x5E01;&#x7684;&#x529F;&#x80FD;&#x548C;&#x7279;&#x5F81;</p>
</li>
<li><p>&#x4EA4;&#x6362;&#x65B9;&#x7A0B;</p>
</li>
</ul>
<h3 id="&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;token&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x5173;&#x7CFB;">&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;token&#x7ECF;&#x6D4E;&#x5B66;&#x7684;&#x5173;&#x7CFB;</h3>
<h4 id="&#x8D27;&#x5E01;&#x7684;&#x529F;&#x80FD;&#x548C;&#x7279;&#x5F81;">&#x8D27;&#x5E01;&#x7684;&#x529F;&#x80FD;&#x548C;&#x7279;&#x5F81;</h4>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;Token&#x901A;&#x5E38;&#x88AB;&#x4F5C;&#x4E3A;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x652F;&#x4ED8;&#x8D27;&#x5E01;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F5C;&#x4E3A;token&#x8BBE;&#x8BA1;&#x8005;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B9E;&#x7528;token&#x4F5C;&#x4E3A;&#x652F;&#x4ED8;&#x8D27;&#x5E01;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F8E;&#x5143;&#x3001;&#x6B27;&#x5143;&#x3001;&#x65E5;&#x5143;&#x6216;&#x4EBA;&#x6C11;&#x5E01;&#xFF1F;&#x4E3A;&#x4E86;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x4E86;&#x89E3;&#x8D27;&#x5E01;&#x7684;&#x529F;&#x80FD;&#x548C;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x8D27;&#x5E01;&#x6709;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#xFF1A;</p>
<ul>
<li><p>&#x4E00;&#x3001;&#x4EA4;&#x6362;&#x5A92;&#x4ECB;</p>
<p>&#x8D27;&#x5E01;&#x53EF;&#x4EE5;&#x8BA9;&#x4EBA;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x73B0;&#x91D1;&#xFF0C;&#x6765;&#x76F8;&#x4E92;&#x4EA4;&#x6362;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x3002;</p>
</li>
<li><p>&#x4E8C;&#x3001;&#x4EF7;&#x503C;&#x50A8;&#x5B58;</p>
<p>&#x8D27;&#x5E01;&#x662F;&#x7528;&#x6765;&#x50A8;&#x5B58;&#x548C;&#x4FDD;&#x62A4;&#x4F60;&#x7684;&#x8D22;&#x5BCC;&#x3002;</p>
</li>
<li><p>&#x4E09;&#x3001;&#x8BB0;&#x8D26;&#x5355;&#x4F4D;</p>
<p>&#x5C31;&#x662F;&#x6D4B;&#x91CF;&#x7269;&#x54C1;&#x7684;&#x591A;&#x5C11;&#x548C;&#x7269;&#x54C1;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
</li>
</ul>
<p>&#x4F46;&#x6709;&#x5F88;&#x591A;&#x8D27;&#x5E01;&#x5F62;&#x5F0F;&#x90FD;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x4E09;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x5982;&#x4F55;&#x6BD4;&#x8F83;&#x4E0D;&#x540C;&#x7684;&#x8D27;&#x5E01;&#x5F62;&#x5F0F;&#x7684;&#x6548;&#x7528;&#xFF1F;&#x5982;&#x4F55;&#x8BC4;&#x4F30;&#x662F;&#x9009;&#x62E9;token&#x8FD8;&#x662F;&#x6CD5;&#x5E01;&#xFF1F;</p>
<p>&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x5BB6;&#x8BA4;&#x4E3A;&#x8D27;&#x5E01;&#x6709;&#x516D;&#x4E2A;&#x4E3B;&#x8981;&#x7279;&#x5F81;&#xFF1A;<strong>&#x8010;&#x4E45;&#x6027;&#x3001;&#x53EF;&#x8F6C;&#x79FB;&#x6027;&#x3001;&#x53EF;&#x5206;&#x5272;&#x6027;&#x3001;&#x53EF;&#x66FF;&#x4EE3;&#x6027;&#x3001;&#x6709;&#x9650;&#x4F9B;&#x7ED9;&#x548C;&#x53EF;&#x63A5;&#x53D7;&#x6027;</strong>&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x8FD9;&#x516D;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x6BD4;&#x8F83;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x7F51;&#x7EDC;&#x4E0A;&#x5B9E;&#x7528;ETH&#x652F;&#x4ED8;&#x548C;&#x5B9E;&#x7528;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x652F;&#x4ED8;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4ECE;&#x8010;&#x4E45;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x7B14;&#x94B1;&#x80FD;&#x627F;&#x53D7;&#x591A;&#x5927;&#x7684;&#x73AF;&#x5883;&#x538B;&#x529B;&#x3002;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x548C;&#x4EE5;&#x592A;&#x5E01;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x8010;&#x4E45;&#x6027;&#x3002;</p>
<p>&#x7136;&#x540E;&#x770B;&#x7B2C;&#x4E8C;&#x4E2A;&#x7279;&#x5F81;&#x2014;&#x2014;&#x53EF;&#x8F6C;&#x79FB;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4EA4;&#x6613;&#x6210;&#x672C;&#x6700;&#x4F4E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8D44;&#x91D1;&#x7684;&#x8F6C;&#x79FB;&#x80FD;&#x529B;&#x6709;&#x591A;&#x5F3A;&#x3002;ETH&#x80FD;&#x591F;&#x5728;&#x51E0;&#x5206;&#x949F;&#x5185;&#x4EE5;&#x8F83;&#x4F4E;&#x7684;&#x6210;&#x672C;&#x5728;&#x5168;&#x7403;&#x8303;&#x56F4;&#x5185;&#x4F20;&#x8F93;&#xFF0C;&#x800C;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x9700;&#x8981;1-2&#x4E2A;&#x5DE5;&#x4F5C;&#x65E5;&#xFF0C;&#x5E76;&#x4E14;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x7684;&#x7535;&#x6C47;&#x6210;&#x672C;&#x3002;ETH&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x4EE5;&#x592A;&#x574A;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x8FDB;&#x884C;&#x4F20;&#x8F93;&#xFF0C;&#x8FD9;&#x662F;&#x5B83;&#x7684;&#x53EF;&#x7F16;&#x7A0B;&#x6027;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F7F;&#x6210;&#x672C;&#x66F4;&#x4F4E;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5546;&#x4E1A;&#x5E94;&#x7528;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF0C;&#x800C;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x65E0;&#x6CD5;&#x53D1;&#x9001;&#x5230;&#x53EA;&#x80FD;&#x5408;&#x7EA6;&#x3002;&#x5728;&#x53EF;&#x8F6C;&#x79FB;&#x6027;&#x4E0A;&#xFF0C;ETH&#x4F18;&#x4E8E;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x3002;</p>
<p>&#x518D;&#x6765;&#x770B;&#x53EF;&#x5206;&#x5272;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x7B14;&#x94B1;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x591A;&#x5C11;&#x4E2A;&#x5C0F;&#x6570;&#x3002;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x662F;0.01&#x7F8E;&#x5143;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;1&#x7F8E;&#x5206;&#x3002;&#x800C;ETH&#x53EF;&#x4EE5;&#x5207;&#x5206;&#x4E3A;10&#x7684;18&#x6B21;&#x65B9;&#x4EFD;&#xFF0C;&#x8FD9;&#x8BA9;&#x4EE5;&#x592A;&#x80FD;&#x7528;&#x4E8E;&#x4EF7;&#x503C;&#x4F4E;&#x4E8E;0.01&#x7F8E;&#x5143;&#x7684;&#x5C0F;&#x989D;&#x4EA4;&#x6613;&#x3002;&#x53EF;&#x5206;&#x5272;&#x6027;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;ETH&#x66F4;&#x4F18;&#x3002;</p>
<p>&#x8D27;&#x5E01;&#x7684;&#x7B2C;&#x56DB;&#x4E2A;&#x7279;&#x5F81;&#x2014;&#x2014;&#x53EF;&#x66FF;&#x4EE3;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0D;&#x540C;&#x8D27;&#x5E01;&#x5355;&#x4F4D;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x3002;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x548C;ETH&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x53EF;&#x66FF;&#x4EE3;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x5355;&#x4F4D;&#x3002;</p>
<p>&#x7B2C;&#x4E94;&#x4E2A;&#x7279;&#x5F81;&#x2014;&#x2014;&#x6709;&#x9650;&#x7684;&#x4F9B;&#x7ED9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x770B;&#x8D27;&#x5E01;&#x7684;&#x4F9B;&#x7ED9;&#x6709;&#x591A;&#x7A00;&#x7F3A;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5BF9;&#x4E8E;&#x521B;&#x5EFA;&#x53D7;&#x4FDD;&#x62A4;&#x7684;&#x4EF7;&#x503C;&#x5B58;&#x50A8;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x548C;ETH&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6709;&#x76F8;&#x540C;&#x7684;&#x63AA;&#x65BD;&#x6765;&#x63A7;&#x5236;&#x65B0;&#x53D1;&#x884C;&#x8D27;&#x5E01;&#x7684;&#x4F9B;&#x7ED9;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x2014;&#x2014;&#x53EF;&#x63A5;&#x53D7;&#x6027;&#xFF0C;&#x8FD9;&#x662F;&#x6307;&#x4E0D;&#x540C;&#x5730;&#x533A;&#x7684;&#x5546;&#x4EBA;&#x5BF9;&#x8D27;&#x5E01;&#x7684;&#x63A5;&#x53D7;&#x7A0B;&#x5EA6;&#x3002;&#x6570;&#x5B57;&#x7F8E;&#x5143;&#x88AB;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7684;&#x4F01;&#x4E1A;&#x548C;&#x4EBA;&#x4EEC;&#x63A5;&#x53D7;&#xFF0C;&#x800C;&#x76EE;&#x524D;&#x63A5;&#x53D7;ETH&#x652F;&#x4ED8;&#x7684;&#x5546;&#x5BB6;&#x660E;&#x663E;&#x8981;&#x5C11;&#x5F97;&#x591A;&#x3002;&#x5728;&#x53EF;&#x63A5;&#x53D7;&#x6027;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;ETH&#x5C31;&#x76EE;&#x524D;&#x6765;&#x770B;&#x7565;&#x900A;&#x4E00;&#x7B79;&#x3002;&#x4F46;&#x662F;&#x5728;&#x672A;&#x6765;&#xFF0C;&#x50CF;&#x6BD4;&#x7279;&#x5E01;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#xFF0C;&#x80FD;&#x5426;&#x6210;&#x4E3A;&#x4E16;&#x754C;&#x8D27;&#x5E01;&#xFF0C;&#x90A3;&#x5C31;&#x53E6;&#x5F53;&#x522B;&#x8BBA;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x53D8;&#x6570;&#x3002;&#x5F53;&#x7136;&#x5BF9;&#x4E8E;&#x67D0;&#x4E00;&#x4E2A;&#x5176;&#x4ED6;&#x7684;&#x5546;&#x4E1A;token&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x8FBE;&#x5230;&#x8FD9;&#x79CD;&#x63A5;&#x53D7;&#x5EA6;&#x3002;</p>
<p>Ben El Baz&#x8BA4;&#x4E3A;&#xFF0C;Token&#x8BBE;&#x8BA1;&#x8005;&#x53EF;&#x4EE5;&#x7ED3;&#x5408;&#x4E0A;&#x8FF0;&#x5206;&#x6790;&#x7ED3;&#x679C;&#xFF0C;&#x6BD4;&#x8F83;&#x7F51;&#x7EDC;&#x7684;&#x7279;&#x5B9A;&#x8BBE;&#x8BA1;&#x548C;&#x76EE;&#x6807;&#xFF0C;&#x6765;&#x8BC4;&#x4F30;&#x662F;&#x5426;&#x5B9E;&#x7528;&#x65B0;&#x7684;&#x652F;&#x4ED8;&#x8D27;&#x5E01;&#x800C;&#x4E0D;&#x662F;&#x6CD5;&#x5B9A;&#x8D27;&#x5E01;&#x3002;</p>
<h4 id="&#x4EA4;&#x6362;&#x65B9;&#x7A0B;&#x5F0F;">&#x4EA4;&#x6362;&#x65B9;&#x7A0B;&#x5F0F;</h4>
<p>&#x8BB8;&#x591A;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x5BB6;&#x8BA4;&#x4E3A;&#xFF0C;&#x8D27;&#x5E01;&#x6570;&#x91CF;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x4E00;&#x4E2A;&#x7ECF;&#x6D4E;&#x4F53;&#x4E2D;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;&#x4EF7;&#x683C;&#x3002;1911&#x5E74;&#x6B27;&#x6587;&#xB7;&#x8D39;&#x820D;&#x5C14;&#x5C06;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#x5F62;&#x5F0F;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x65B9;&#x7A0B;&#x5F0F;&#xFF0C;&#x79F0;&#x4E3A;&#x201C;&#x4EA4;&#x6362;&#x65B9;&#x7A0B;&#x5F0F;&#x201D;&#xFF0C;&#x4E5F;&#x53EB;&#x201C;<strong>&#x8D39;&#x96EA;&#x65B9;&#x7A0B;&#x5F0F;</strong>&#x201D;&#x3002;&#x65B9;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>  M*V = P*Q</p>
<p>&quot;M&quot;&#x662F;&#x6307;&#x8D27;&#x5E01;&#x7684;&#x603B;&#x4F9B;&#x7ED9;&#x91CF;&#x3002;&#x201C;V&#x201D;&#x6307;&#x8D27;&#x5E01;&#x7684;&#x6D41;&#x901A;&#x901F;&#x5EA6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x8D27;&#x5E01;&#x603B;&#x4F9B;&#x7ED9;&#x91CF;&#x7684;&#x5E73;&#x5747;&#x6362;&#x624B;&#x6B21;&#x6570;&#x3002;&#x201C;P&#x201D;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x7ECF;&#x6D4E;&#x4F53;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x4EE5;&#x8D27;&#x5E01;&#x8BA1;&#x4EF7;&#x7684;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;&#x5E73;&#x5747;&#x4EF7;&#x683C;&#x6C34;&#x5E73;&#x3002;&#x201C;Q&#x201D;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x7ECF;&#x6D4E;&#x4F53;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x8D2D;&#x4E70;&#x7684;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;&#x603B;&#x6570;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x6817;&#x5B50;&#xFF1A;</p>
<p>&#x60F3;&#x8C61;&#x4F60;&#x4F4F;&#x5728;&#x4E00;&#x4E2A;&#x5B64;&#x5C9B;&#x4E0A;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5C9B;&#x4E0A;&#x4EBA;&#x4EEC;&#x628A;&#x8D1D;&#x58F3;&#x5F53;&#x94B1;&#x7528;&#x3002;&#x4E00;&#x5E74;&#x4E4B;&#x5185;&#xFF0C;&#x4EBA;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x5C9B;&#x4E0A;&#x4EA4;&#x6613;100&#x4EF6;&#x4E0D;&#x540C;&#x7684;&#x8D27;&#x7269;&#x3002;&#x8FD9;&#x4E9B;&#x8D27;&#x7269;&#x7684;&#x5E73;&#x5747;&#x4EF7;&#x683C;&#x662F;10&#x4E2A;&#x8D1D;&#x58F3;&#x3002;&#x4F7F;&#x7528;&#x4EA4;&#x6362;&#x65B9;&#x7A0B;&#x5F0F;&#xFF0C;&#x5C06;&#x4EF7;&#x683C;&#xFF08;10&#xFF09;&#x4E58;&#x4EE5;&#x4EA4;&#x6613;&#x603B;&#x6570;&#xFF08;100&#xFF09;&#xFF0C;&#x8BA1;&#x7B97;&#x65B9;&#x7A0B;&#x5F0F;&#x53F3;&#x4FA7;&#xFF0C;&#x7B49;&#x4E8E;&#x603B;&#x7ECF;&#x6D4E;&#x6D3B;&#x52A8;&#xFF08;1000&#xFF09;&#x3002;&#x65B9;&#x7A0B;&#x5F0F;&#x7684;&#x5DE6;&#x8FB9;&#x5462;&#xFF1F;&#x5047;&#x8BBE;&#x5C9B;&#x4E0A;&#x7684;&#x8D1D;&#x58F3;&#x4F9B;&#x5E94;&#x91CF;&#x662F;50&#x3002;&#x4E3A;&#x4E86;&#x8BA9;1000&#x4E2A;&#x8D1D;&#x58F3;&#x7684;&#x7ECF;&#x6D4E;&#x6D3B;&#x52A8;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8D1D;&#x58F3;&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FD9;50&#x4E2A;&#x8D1D;&#x58F3;&#x5728;&#x4E00;&#x5E74;&#x5185;&#x6362;&#x624B;20&#x6B21;&#x3002;&#x8FD9;&#x4E2A;20&#x5C31;&#x662F;&#x8D27;&#x5E01;&#x7684;&#x6D41;&#x901A;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;token&#x8BBE;&#x8BA1;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;</p>
<ul>
<li><p>&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4E86;<strong>&#x8D27;&#x5E01;&#x7684;&#x4EF7;&#x683C;&#xFF08;&#x4E5F;&#x79F0;&#x201C;&#x8D27;&#x5E01;&#x7684;&#x8D2D;&#x4E70;&#x529B;&#x201D;&#xFF09;&#x662F;&#x5982;&#x4F55;&#x53D6;&#x51B3;&#x4E8E;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x91CF;&#x3001;&#x8D27;&#x5E01;&#x6D41;&#x901A;&#x901F;&#x5EA6;&#x548C;&#x7ECF;&#x6D4E;&#x4F53;&#x5185;&#x7684;&#x8D38;&#x6613;&#x989D;&#x7684;</strong>&#x3002;&#x8D27;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x5BB6;&#x5728;&#x8BBE;&#x8BA1;&#x653E;&#x5BBD;&#x6216;&#x6536;&#x7F29;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x91CF;&#x589E;&#x957F;&#xFF0C;&#x6765;&#x5F71;&#x54CD;&#x4EF7;&#x683C;&#x6C34;&#x5E73;&#x7684;&#x8D27;&#x5E01;&#x653F;&#x7B56;&#x65F6;&#xFF0C;&#x5C31;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x3002;&#x7ECF;&#x6D4E;&#x5B66;&#x5BB6;&#x8FD8;&#x8BA4;&#x4E3A;&#xFF0C;&#x8D38;&#x6613;&#x989D;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x4EF7;&#x683C;&#xFF1B;&#x7136;&#x800C;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x653F;&#x7B56;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x6539;&#x53D8;&#x6D41;&#x901A;&#x901F;&#x5EA6;&#x548C;&#x5F71;&#x54CD;&#x4EF7;&#x683C;&#x3002;</p>
</li>
<li><p>&#x5176;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;<strong>&#x4EA4;&#x6362;&#x65B9;&#x7A0B;&#x4E0D;&#x9002;&#x5408;&#x8BA1;&#x7B97;&#x4E0D;&#x540C;&#x8D27;&#x5E01;&#x4E4B;&#x95F4;&#x7684;&#x6C47;&#x7387;</strong>&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;token-&#x7F8E;&#x5143;&#x6C47;&#x7387;&#x3002;&#x903B;&#x8F91;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x53EA;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x968F;&#x7740;token&#x4F9B;&#x5E94;&#x7684;&#x589E;&#x52A0;&#x6216;&#x4EA4;&#x6613;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;token&#x4EF7;&#x683C;&#x662F;&#x5982;&#x4F55;&#x53D8;&#x5316;&#x7684;&#x3002;token-&#x7F8E;&#x5143;&#x6C47;&#x7387;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#xFF1B;token-&#x7F8E;&#x5143;&#x4EF7;&#x683C;&#x662F;token&#x4E0E;&#x7F8E;&#x5143;&#x7684;&#x6BD4;&#x7387;&#xFF08;&#x4E00;&#x79CD;&#x6C47;&#x7387;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x8005;&#x5E0C;&#x671B;&#x5728;&#x4EF7;&#x683C;&#x4E0A;&#x5347;&#x503C;&#x7684;&#xFF1B;&#x5B83;&#x4E0D;&#x662F;token&#x4E0E;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;&#x6BD4;&#x7387;&#x3002;</p>
</li>
</ul>
<h4 id="&#x5982;&#x4F55;&#x5229;&#x7528;&#x8D39;&#x96EA;&#x516C;&#x5F0F;&#x63D0;&#x9AD8;token&#x8BBE;&#x8BA1;&#x6280;&#x5DE7;">&#x5982;&#x4F55;&#x5229;&#x7528;&#x8D39;&#x96EA;&#x516C;&#x5F0F;&#x63D0;&#x9AD8;token&#x8BBE;&#x8BA1;&#x6280;&#x5DE7;</h4>
<ul>
<li><p>&#x9996;&#x5148;&#xFF0C;&#x4E0D;&#x8981;&#x5236;&#x9020;&#x590D;&#x6742;&#x7684;&#x6FC0;&#x52B1;&#x6765;&#x64CD;&#x7EB5;token&#x6D41;&#x901A;&#x901F;&#x5EA6;&#x3002;&#x6D41;&#x901A;&#x901F;&#x5EA6;&#x4E0D;&#x91CD;&#x8981;&#x3002;</p>
</li>
<li><p>&#x5176;&#x6B21;&#xFF0C;MV=PQ &#x672C;&#x8EAB;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x786E;&#x5B9A;token-&#x7F8E;&#x5143;&#x6C47;&#x7387;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x662F;&#x7A33;&#x5B9A;token&#x4EF7;&#x683C;&#xFF0C;&#x90A3;&#x4E48; MV=PQ &#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x8BBE;&#x8BA1;&#x8D27;&#x5E01;&#x653F;&#x7B56;&#xFF0C;&#x6765;&#x7A33;&#x5B9A;&#x4F60;&#x7F51;&#x7EDC;&#x4E0A;&#x4EA4;&#x6613;&#x7684;token&#x5B9A;&#x4EF7;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x4FDD;&#x6301;10token&#x7684;&#x7A33;&#x5B9A;&#x4EF7;&#x683C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x4F60;&#x7684;token&#x8D27;&#x5E01;&#x653F;&#x7B56;&#xFF0C;&#x6839;&#x636E;&#x4EA4;&#x6613;&#x91CF;&#x6216;&#x4EA4;&#x6613;&#x901F;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x589E;&#x52A0;&#x6216;&#x51CF;&#x5C11;token&#x4F9B;&#x5E94;&#xFF0C;&#x6765;&#x5728; MV=PQ &#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#x7684;token&#x4EF7;&#x683C;&#x3002;</p>
</li>
<li><p>&#x518D;&#x8005;&#xFF0C;MV=PQ &#x8FD8;&#x662F;&#x6709;&#x4E2A;&#x201C;&#x95F4;&#x63A5;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x9884;&#x4F30;token-USD&#x6C47;&#x7387;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x6BD4;&#x8F83;&#x6570;&#x5B66;&#x6027;&#x3002;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x767D;&#x76AE;&#x4E66;&#x4E2D;&#x5BF9;&#x6D41;&#x901A;&#x7684;&#x8BB2;&#x89E3;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x91CD;&#x70B9;&#x8FD8;&#x662F;&#x60F3;&#x8BA9;&#x5927;&#x5BB6;&#x8BA4;&#x8BC6;&#x5230;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x91CF;&#x548C;token&#x6570;&#x91CF;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;</p>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="CH05.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Token的供给和需求">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"用货币经济学进行token设计","level":"1.3.6","depth":2,"previous":{"title":"Token的供给和需求","level":"1.3.5","depth":2,"path":"Token_Economics_Incentive_design/CH05.md","ref":"Token_Economics_Incentive_design/CH05.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-livereload","search-plus","include-codeblock","ace","splitter","mathjax","emphasize","expandable-chapters","sectionx","back-to-top-button","chapter-fold","todo","terminal","alerts","simple-page-toc"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"chapter-fold":{},"emphasize":{},"ace":{},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"todo":{},"splitter":{},"fontsettings":{"theme":"white","family":"sans","size":2},"sectionx":{"tag":"b"},"highlight":{},"back-to-top-button":{},"alerts":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"include-codeblock":{"check":false,"edit":true,"fixlang":false,"lang":"","template":"ace","theme":"chrome","unindent":true},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"terminal":{"copyButtons":true,"fade":false,"style":"flat"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{},"search-plus":{}},"theme":"default","author":"听风","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cryptoeconomics","language":"zh-hans","output.name":"blocklee","links":{"sidebar":{"Home":"https://f-labs.github.io/Cryptoeconomics"},"styles":{"website":"styles/website.css"}},"gitbook":"3.2.3","description":"分布式系统的加密经济学原理与设计"},"file":{"path":"Token_Economics_Incentive_design/CH06.md","mtime":"2019-05-05T09:26:02.991Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-05T09:27:33.904Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ace/ace/ace.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ace/ace.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-terminal/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

